[
  {
    "id":"1ljyanl",
    "title":"I tried using AI to write social posts. Now I’m addicted... and slightly scared.",
    "text":"Tried ChatGPT to write a few LinkedIn captions last month.  \nNow it’s writing product descriptions, ad copy, blog outlines, customer emails... even meeting agendas.\n\nWhat started as “just a test” turned into “wait, this is kind of running half my content ops.”\n\nIt’s saving a ton of time, but I’m also like — am I even doing marketing anymore, or just prompting really well?\n\nCurious how you all are balancing human vs AI in your marketing workflows.  \nWhat’s working? What’s getting weird?",
    "created_utc":1750832433.0,
    "subreddit":"DigitalMarketing",
    "num_comments":116,
    "score":50,
    "sentiment":0.8123
  },
  {
    "id":"1lict7u",
    "title":"10+ marketing tools I use almost every single day and why",
    "text":"Just sharing some tools I find endless value from for new marketers since I see a lot of posts on here about “how do I get started, what should I learn, etc.”\n\n**A little about me for context:**\n\n* Been marketing 15 years\n* Generalist with undergrad degree in psych (no formal marketing training)\n* Generated over $100M in my career\n* Currently leading a SaaS marketing team, but have worked in CPG too.\n* Have managed teams up to 15 people in size\n\nFeel free to share your tools below!\n\n* ***OneTab*** \\- Honestly this chrome extension changed my life. I’m one of those people who keeps 47 tabs open, then feels stressed about having them open, but also stressed about closing them. OneTab allows me to get a fresh slate every morning without any concern about losing something.\n* ***Klaviyo*** \\- Without a doubt, Klaviyo is best marketing email platform for the money. The automation features are unbelievable and the integrations are really solid as well. To me, klaviyo brings big business segmentation and automation to small marketing teams in an easy to use interface with super transparent pricing.\n* ***GA4*** \\- K I actually hate GA4, but it is what it is. Learn this thing because you need it, like it or not. It’s the standard.\n* ***Frizerly*** \\- Its a great AI agent that learns all about your business and competitors to automatically publish an SEO blog every day on your website helping us improve our Google ranking. Saves me and my team 10+ hours every week! \n* ***Google ads*** \\- This is the first ads channel you should learn inside out. Mainly because it’s the easiest one to find success with (because the technology is much better than any other ads platform, and because search ads capture intent instead of trying to capture interest). Between Google and YouTube, you’ve got access to the majority of the internet with this one platform.\n* ***Asana*** \\- Absolutely love asana. The most intuitive and powerful project management system (also FREE). I’ve tried jira, trello, Monday, notion, and clickup and they are all lackluster compared to asana when it comes to marketing project management. The functional advantages of subtasks, customizable tags, different options for views, messages and comments, attachments… this is the one system that actually works.\n* ***Noun project*** \\- There are so many underwhelming stock image sites. I really love this site. Most of my marketing graphics are either using icons or photos and noun project has the best selection for the best price, hands down. Also love that you can customize icons.\n* ***Google slides & Google sheets*** \\- Don’t roll your eyes because most marketers I’ve worked with aren’t using half of the functionality these free tools offer. Namely, the ability to create a beautiful strategy deck that shows you thought about something and distilled it into a usable format for leadership and your team. But things like pivots, well made chart visuals, data formatting formulas, etc are all underutilized. Also, I’d rather use sidewalk chalk than PowerPoint and excel.\n* ***Apollo*** \\- Cold emails are tough, but I think for the money you can’t beat Apollo. It pulls in the stuff you typically have to pay a ton for like a huge database of contacts, recordable calls with transcripts and snippets, etc for a flat affordable monthly rate. Basically a mashup of zoominfo and gong for a fraction of the price of both. I will say: the data dashboards are absolutely horrible. Like unusable.\n* ***Loom*** \\- Can’t tell you how helpful it is for async communication and documentation to just record my screen while I’m taking and send it to someone. Hidden gem: AI transcription is a nice feature. These also work for recording product demos.\n* ***ChatGPT*** \\- Yeah we get it, AI is a thing and some of us hate it and some of us love it. Here’s how I use this one: organizing a mess of notes into a coherent doc, drafting blog posts, generating customer avatars that I can ask questions, preparing for job interviews, negative keyword lists, and competitive analysis. There is a really good episode of Paid Search Podcast called “talking to your data” that has cool ideas for parsing Google ads data with chatgpt as well. You just have to understand: 90% of the copy and ideas you get from ChatGPT is unusable trash. But the 10% is well worth it.\n* ***Reddit*** \\- lol. I mean, every time I have a question I can’t find an answer to, I come here and ask, and I get answers. Sometimes on the most niche things. Aside from that, it’s a fantastic listening tool. Jump into a forum and just look at what people say about the problem your business solves, your competitors, you, etc.\n* ***TinyPNG*** \\- Throughout my career, it’s been a common theme that I get an image from a designer for an email and it’s like 4.5mb. I love the emphasis on quality… but I’m not going to bog my email down with that. Tinypng is free and almost always cranks the image down to a few KB without making it look like shit.\n* ***LinkedIn*** \\- I received 3 job offers in one month because I built a solid personal brand before I started looking for my most recent role. Yes, your connections (quantity and quality) do matter. Yes, it matters if you post on there actively. Additionally, it’s (slightly) easier for me to book demos and spread awareness around whatever brand I’m working on. I don’t recommend premium or sales nav. No added value IMO.\n\nThose are the main ones. What about you?",
    "created_utc":1750673388.0,
    "subreddit":"DigitalMarketing",
    "num_comments":84,
    "score":232,
    "sentiment":0.9996
  },
  {
    "id":"1ltrdyo",
    "title":"I tried 30+ AI Marketing tools. Here is my favorite 5! What are yours?",
    "text":"Over the long weekend, I had a little bit of extra time and so I went on a journey to explore the world of AI in marketing. I have been hearing a lot of AI tools but honestly hadn't had the time to check any of them other than ChatGPT, which I obviously use daily for the last 1 year I guess.\n\nI ended up trying 30+ AI marketing tools and here were the 5 I ended up loving personally\n\n1. **Google Veo:** Amazing AI tool to create videos\/footage for marketing just using AI prompts. Way better than Sora by Open AI as well\n2. **Playground**: Great AI tool create graphic designs using marketing using AI without a graphic designer!\n3. **Frizerly:** The tool with the best AI features of all the SEO tools out there.  I personally love the feature where I can connect my Wordpress and it can auto publish blogs daily based on the keywords I have prioritized. \n4. **Clay**: Great tool to automated outbound email and LinkedIn marketing. Essentially like Apollo but automated using AI\n5. **Plai**: Great too to A\/B test ads using AI. I love the concept and I am currently using it for Google ads.\n\nDid I miss your favorite it? Let me know below :)",
    "created_utc":1751886580.0,
    "subreddit":"DigitalMarketing",
    "num_comments":68,
    "score":138,
    "sentiment":0.9977
  },
  {
    "id":"1lo4nly",
    "title":"What’s actually working for you in 2025?",
    "text":"With platforms constantly changing and AI everywhere, it feels like half of what worked last year doesn’t anymore.\n\nWould love to know—what channel, strategy, or tool is actually getting you results right now? No fluff, just real wins. Could help a lot of folks (including me) refocus our efforts.",
    "created_utc":1751281459.0,
    "subreddit":"DigitalMarketing",
    "num_comments":44,
    "score":25,
    "sentiment":0.9054
  },
  {
    "id":"1lozw0u",
    "title":"I tried Semrush Alternatives for SEO & Here is what I found out",
    "text":"Hi all- I have been in the SEO space for like 10 years and I mostly have always went with Semrush till last year for all my clients asking for SEO.\n\nHowever recently I found their UI\/UX to be really terrible and have been researching some alternatives. I also didn’t like any of their AI features- they seem to have stagnated in innovation.\n\nSo I tried a bunch of different Semrush alternatives for SEO and here is my honest thoughts on the top 5 I personally liked in no particular order:\n\n1. **Ahrefs**: A decent all-in one advanced SEO tool. I found Ahrefs very similarly to Semrush both in terms of pricing and usability. If you are not happy with Semrush, you are probably not going to be happy with Ahrefs. Like Semrush, this is a great tool for advanced SEO geeks and agencies managing multiple projects and want fine grained control over everything SEO.\n2. **Ubersuggests**: Ubersuggest is much cheaper than Ahrefs and Semrush but I personally did not like it at all.\n3. **Moz**: I personally really like Moz. It’s slightly cheaper and I found their interface to be much cleaner than Ahrefs and Semrush. The only issue I had with Moz was, their AI integrations suck and if you are looking for AI stuff, this is not for you. If not, this would be the winner for me :)\n4. **Frizerly:** If you are an AI enthusiast\/early adopter and want to explore how AI can help with SEO, Frizerly is the tool for you. It doesn’t offer as many advanced fine tuning stuff like Ahrefs\/Semrush. So its great for people who is aiming to get 80% results from 20% effort haha. I personally love the feature where I can connect my Wordpress and it can auto publish blogs daily based on the keywords I have prioritized. \n5. **Screaming Frog**: If you are looking for a tool with a great free version, go with Screaming Frog. For the free ones, this is be far the best. If you are willing to pay, not so much!\n\nAnd that’s about it. I know this is a hotly debated  topic. So if you disagree and have a different favorite tool,  comment below. Happy to debate :)",
    "created_utc":1751371502.0,
    "subreddit":"DigitalMarketing",
    "num_comments":38,
    "score":74,
    "sentiment":0.9972
  },
  {
    "id":"1lukear",
    "title":"Is it just me, or does email marketing feel like it’s fading away in the digital chaos?",
    "text":"I’ve been reflecting a lot lately on how noisy digital marketing has become, social ads, influencers, short-form videos, SEO battles, AI-generated everything... Amid all this, I can't help but wonder:\n\nIs email marketing still relevant, or are we holding on to something that just doesn’t connect the way it used to?\n\nDo people even open emails anymore unless it's a password reset or order confirmation? \n\nI'd love to hear your honest thoughts, not from a business or promotional angle, but as digital marketers who've watched this space evolve.\n\nHas email evolved... or evaporated?",
    "created_utc":1751967886.0,
    "subreddit":"DigitalMarketing",
    "num_comments":35,
    "score":10,
    "sentiment":0.8699
  },
  {
    "id":"1m23uub",
    "title":"What are you seeing actually move the SEO needle in 2025?",
    "text":"No fluff. No vague theories.\n\nI’m seeing a strange divide in SEO right now: on one side, AI-generated everything and on the other, Google's clear push for real experience, semantic relevance, and user intent.  \nBut it’s getting harder to tell what really works vs what just sounds good on LinkedIn.\n\nI'm not here to pitch anything  just want to learn from people who are actually doing the work.\n\n What specific strategies, formats, or shifts are actually helping you improve rankings in 2025?\n\nExamples could be:\n\n* Semantic SEO structures?\n* Refreshing old content with real-world insights?\n* Page experience + Core Web Vitals?\n* Topical maps or entity optimization?\n* Social signals or branded search volumes?\n\nIf you're in the SEO\/content trenches, I’d love to hear your honest take.  \nWhat’s real and what’s noise in today’s algorithm-driven landscape?\n\n",
    "created_utc":1752747635.0,
    "subreddit":"DigitalMarketing",
    "num_comments":33,
    "score":4,
    "sentiment":0.9843
  },
  {
    "id":"1m25zjk",
    "title":"What is LLM SEO?",
    "text":"\nLLM SEO means optimizing your content so it's easily understood and ranked by AI tools like ChatGPT, Google’s SGE (Search Generative Experience), and Bing Copilot, which use large language models.\n\nInstead of just thinking about how Google ranks pages, LLM SEO focuses on how AI answers questions using content from across the web.\n\n Key LLM SEO Strategies (Simple Points):\n\nWrite clearly and conversationally\n → AI picks up natural, easy-to-read content faster.\nAnswer real user questions\n → Use FAQs and “People Also Ask”-style answers.\nStructure the content well\n → Use headings (H1, H2), bullet points, and short paragraphs.\nInclude facts and context\n → LLMs love well-researched, detailed content with clear data.\nUse schema markup\n → Helps AI and search engines understand your content better.\nKeep your content updated\n → AI prefers fresh, relevant information.\n\nExample:\nIf someone asks:\n\"What are the best shoes for wide feet?\"\n\n AI tools scan the web for clear, helpful content to generate an answer.\n\n If your site has a section like:\n“Our Italian-made shoes in sizes 42–45 are perfect for wide feet. They're designed for comfort, support, and all-day wear.”\n\n …it has a higher chance of being cited.\n\n\n",
    "created_utc":1752754611.0,
    "subreddit":"DigitalMarketing",
    "num_comments":32,
    "score":8,
    "sentiment":0.9937
  },
  {
    "id":"1lr6g2d",
    "title":"My wife and I also started a brand and have had very slow growth. We need your marketing advice.",
    "text":"Hello!\n\nMy wife and I launched a website in October 2024 with a goal to help future couples save time, money, and stress with planning their South Asian wedding. \n\nAs you may have heard, the big fat Indian weddings are really fun, but a huge pain in the ass to plan. There’s 1000s of decisions, logistics, competing family priorities, not to mention the cost, and so much more. It felt like a second job for 13 months to plan our 3 day wedding. \n\nWe asked our friends about their wedding planning experience and all of them said it sucked..a lot\n\nSo we’re on a journey to build a wedding planning platform that provides informational guides on SEO focused keywords, build and sell planning tools & templates, and eventually get a specific South Asian vendor data base going. For now we’re scoping it to the US and Canada.  \n\nWe are primarily doing SEO and Instagram reels for marketing. Our SEO took a huge hit in December 2024 with AI overviews and the google update. \n\nFor Instagram we are posting wedding planning tips, trends, memes, and more which is slowly growing our follower count\n\nWe haven’t done ads yet as I’m still learning how to design them, but definitely planning to start this month.\n\nWhat advice do you have to help us generate\nmore sales and create more brand awareness to grow this? We’re really trying to impact as many couples as possible so they don’t have to go through what countless other couples have.\n\nAny advice, nuggets, tips, recommendations, etc. would be super appreciated. Thank you!",
    "created_utc":1751592496.0,
    "subreddit":"DigitalMarketing",
    "num_comments":25,
    "score":11,
    "sentiment":0.9901
  },
  {
    "id":"1lrcsiu",
    "title":"Why I Won’t Fake a Typo Just to Pretend It Wasn’t LLM-Processed",
    "text":"Lately, I’ve been watching a strange shift unfold on LinkedIn and across content teams: marketers avoiding hyphens like they’re radioactive. Not because they forgot how to use them, but because they’re afraid a dash too many will make their text look “too polished” — too AI-generated.\n\nAdd to that the flood of posts about the MIT study “Your Brain on ChatGPT” and sharp comments like this one from Steffi Kieffer. All of it urging us to rely on common sense and our own brainpower first, not the machine.\n\nWe’ve entered the uncanny valley of copywriting.\n\n# When the Medium Loses the Message\n\nYou see it on forums and Slack groups: people prompt ChatGPT to “add some typos,” “repeat a phrase or two,” or “make it sound a bit less perfect.” Why? To fool AI detectors — and people — into thinking it came straight from the keyboard.\n\nWe’ve now built tools to *generate* content with AI, *detect* that AI-generated content, and then *humanize* it to avoid detection.\n\nWe’re no longer writing for humans — we’re writing for bots, detectors, and algorithms.\n\nAnd yes, I use AI tools. I love them. They help me brainstorm, rewrite, proofread, and compress. But if we spend more time prompting, re-prompting, and de-robotizing than actually thinking and writing, something’s gone seriously wrong.\n\n# A Story of Hyphens (and How We Lost the Plot)\n\nOnce upon a time, in the golden age of copywriting, we could use em-dashes — for dramatic pauses — or hyphens for compound adjectives (like AI-powered tools) without second-guessing ourselves. Dashes gave our writing rhythm. Structure. Personality.\n\nOn social media, we *couldn’t* use them for a while — most platforms didn’t support formatting. But now, with content copied from LLMs, we *can*. So why not?\n\nBecause today? Hyphens look suspicious. Dashes are considered AI giveaways. And God forbid you use a semicolon.\n\nSo people strip punctuation — not for style, but for plausible deniability.\n\n# Making Mistakes on Purpose ≠ Authenticity\n\nThis reminds me of early SEO. We stuffed keywords in white text on white backgrounds and copy-pasted the same paragraph across 50 pages. Then Google updated its algorithm, and suddenly, *originality* and *helpfulness* became ranking factors.\n\nNow, we’re doing the same thing with AI content. We are faking originality. Yes, I’ll say it again: We are FAKING. ORIGINALITY.\n\nPeople prompt LLMs to add “natural flaws” or mess up the structure, just like we used to stuff meta descriptions with gibberish. It’s SEO 2010 all over again. Except this time, we’re optimizing to *not look optimized*.\n\n# But Who’s Actually Winning?\n\nThe rise of Reddit, Substack, and the enduring trust in Wikipedia (as Elena Verna pointed out in one of her newsletters) tells us something:\n\nPeople want real voices. Not recycled content. Not AI-flavored filler. Not copy-paste insights.\n\nThe folks most excited about copy.ai, Jasper, or the early days of ChatGPT? Often those who lacked confidence in their writing. And that’s okay — AI felt liberating.\n\nBut the flip side is a content landfill. Shallow. Repetitive. Styleless.\n\n# Here’s What I Do (And What I Won’t Do)\n\nI use LLMs every day. To rephrase, explore tone, tighten intros. But the ideas? The structure? The examples and arguments? All mine.\n\nWhen I write technical content for companies, it’s the experts’ brains doing the heavy lifting. AI is a polish, not a pen.\n\nWhy? Because I don’t want to flood the internet with another “10 tips on using AI in your business” post.\n\nI want to add something. And if I don’t have anything original to say? I’d rather stay quiet.\n\n# On Agents, Prompts, and Real Marketing\n\nYes, I’ve tested the full “AI marketing agent” stack — brief in, blog out, podcast clip generated, landing page written.\n\nImpressive? Sure. Useful? Sometimes. Sufficient for professional services and complex positioning? Still too shallow.\n\nGreat marketing, like great filmmaking, is made in the edit. In the decisions. In the cuts, not just the footage.\n\nReal writing is rewriting. Selecting. Deleting. Crafting tone — not just pumping out volume.\n\n# Let’s Not Die Empty\n\nHere’s what I care about most.\n\nI don’t want to live in a world where we create brilliant business ideas — and present them in dull, generic, lifeless language. Where tone, voice, and rhythm vanish. Where we don’t admire a sentence the way we admire a melody.\n\nI still read *The New Yorker* and *The Economist* — not just for information, but for *style*. For *boldness*. For *voice*.\n\nBecause if we replace creativity with recycling, it won’t be long before AI hires *us* to write with style and originality.\n\nBecause we’ve lost that muscle.\n\nLet’s not let that happen.\n\nLet’s use AI to augment creativity — not fake it. Let’s keep the weird dashes and the real ideas. Let’s stay human.\n\nSeriously.\n\nWhat do you think?\n\nK.",
    "created_utc":1751614428.0,
    "subreddit":"DigitalMarketing",
    "num_comments":21,
    "score":0,
    "sentiment":0.9977
  },
  {
    "id":"1lqysim",
    "title":"Automated appointment setter",
    "text":"Hi everyone\n\nMy friend recently developed an AI appointment setter which basically checks your inbox, detects meeting requests, checks your availability based on your calendar and books the meeting. I'm one of the few ones that got to try it and I saved a lot of time from the usual back and forth when setting a meeting with someone. He's now running a waitlist with over 300 people lined up.\n\nI'm one of the people that benefits from this but I'm curious if this is really a pain point more people face than I expected 🤔",
    "created_utc":1751571543.0,
    "subreddit":"DigitalMarketing",
    "num_comments":21,
    "score":5,
    "sentiment":0.2222
  },
  {
    "id":"1lnh2w8",
    "title":"Click Up or Asana?",
    "text":"I have a small marketing agency of 2 (myself and one other)\n\nI’ve been getting busy and disorganized and wanting to bring on new people so I figured it’s time for a integrated workspace.\n\nI’m considering click up and Asana. I’m a visual person so less is more but also I like that click up has the AI brain and timesheets.\n\nI’m struggling to figure out what is best and why.\n\nIf you’ve used either of these, can you share what you like or didn’t like?\n\nAnything helps, thank you!\n",
    "created_utc":1751210029.0,
    "subreddit":"DigitalMarketing",
    "num_comments":20,
    "score":3,
    "sentiment":0.9696
  },
  {
    "id":"1lqr1go",
    "title":"How I got my site ranking in Google’s AI Overview",
    "text":"I’ve been experimenting a lot lately, and I finally got some of my pages featured in Google’s AI Overview \/ AI Mode results.\n\nHere’s what helped me (in summary):\n\n* Answered the question clearly in the first few lines\n* Focused on real search terms people use, not just broad topics\n* Created helpful content around one topic to build authority\n* Used headings, bullet points, and FAQs to make it easy to read\n* Added author name, short bio, and a proper author page\n* Made sure my site looks good and loads fast on mobile\n* Added a LLMS.txt file\n* Didn’t obsess over keyword density, just kept it natural and clear\n\nI didn’t buy links or run ads. Just gave people what they’re actually searching for and made sure Google could understand it easily.",
    "created_utc":1751553016.0,
    "subreddit":"DigitalMarketing",
    "num_comments":19,
    "score":23,
    "sentiment":0.9729
  },
  {
    "id":"1m0sk8j",
    "title":"AI SEO vs Trad SEO",
    "text":"After going through multiple sub-reddits since last few weeks, I feel like there are 2 different categories of people experiencing GEO in 2 different ways causing 2 different opinions.\n\n1. People working with already well established SEO - A world-class SEO ensures high chances of being mentioned by the AI engines. These people without any additional effort are able to get referenced by the AI engines & hence, the belief that SEO is enough and GEO is a spoof. This category might also have traditional SEO agencies who are not willing to evolve with the changing world.\n\n2.  People working to establish their presence using all means - They don’t have great SEO that can help them get listed on the top ranks of Google SERP. They try GEO as an alternative to get some traffic. As a result, post optimization they are able to get some traffic because AI engines doesn’t work the way traditional Google Search works. Hence, a pro-GEO stand. \n\nIn my opinion, as AI engines refer only 30% of the total links it refers from the first SERP. It provides opportunity for players with less optimised SEO to get traffic from AI. ",
    "created_utc":1752610679.0,
    "subreddit":"DigitalMarketing",
    "num_comments":18,
    "score":7,
    "sentiment":0.9628
  },
  {
    "id":"1lzpm7u",
    "title":"I Made My First Digital Product. How Should I Promote It?",
    "text":"I recently made my first digital product – a pack of AI prompts to help people get better results with tools like ChatGPT for content creation.\n\nI’m new to this and don’t have a big following, so I’m not sure how to market it without being spammy.\n\nI’ve listed it on Gumroad, payhip and kofi. But I’m not sure where or how to promote it properly.\n\nWould love any tips on:\n\nWhere can I share it?\nShould I give a free sample?\nIs it worth making free content to promote it?\n\nI tried like promoting it on reddit but all the subs have rules like u can't promote it n all. Please help me!!!",
    "created_utc":1752507318.0,
    "subreddit":"DigitalMarketing",
    "num_comments":16,
    "score":8,
    "sentiment":0.9931
  },
  {
    "id":"1m315oc",
    "title":"12 hours with ChatGPT Agent: What do agents mean for b2b marketing?",
    "text":"OpenAI launched \"ChatGPT Agent\" last night (UK time). **Short story:** It can use its own computer. And they trained it to be really good at creating PowerPoint slides for you.\n\n**Long story....**\n\nIt combines the best bits of Operator (which I have long championed), Deep Research, o3, and the ChatGPT interface. It can run for 30-40mins on complex tasks using a range of tools to get a job done. Those tools include a web browser, image generator, deep research, and writing code. It uses the existing data connectors to grab content from your own web apps (SharePoint, Teams, Google Drive, Github etc..) to work with your tools.\n\nBut what does it mean for b2b marketing? Well in short EVERYTHING\n\n*This post is aimed at marketing teams, departments or agencies (I run an agency focused on b2b marketing).*\n\nChatGPT Agent is the latest in a trend of AI products with 2 key features. First they have tools. That means they can do a bunch of different things (and they choose themselves when and how to use them). Two of these tools are searching the web and writing the code. These open up a huge number of sub capabilities. The second key feature is the ability to work for an extended period of time \"on their own\". Combined this means this sort of AI product can be given a fairly complex task and be left to do it. By go to example for b2b marketing.... putting together the monthly social media report for a wider team or the board. It normally looks a bit like this:\n\n* Login to LinkedIn and note down the data in Word\n* Do the same in X, or use a third party tool you connected to it\n* Do the same in Instagram or any other platform you need\n* You've already lost an hour\n* Then login to Google Analytics to grab relevant website data\n* This is an hour by itself, GA is a nightmare I think\n* Then you've got a load of numbers, time to fight with PowerPoint to make a deck\n* Spend 3hrs doing this, trying to keep it all on brand\n* Finish and make coffee to celebrate\n* Remember you have forgotten to add any insights, go back and do that\n* You've spent all day on it now.\n* Finish up by emailing it to the team, and wait for the 100 questions by return email\n\nChatGPT Agent can do this whole process for you.   \n\n\nI have been testing it with this sort of task:\n\n>\"We are running an set of SEO emails in MailChimp, an automation. I think we have sent 5 of 10 or so. Can you review their performance and give me a slide I can present to the Leadership Team to show how they doing. They for leadgen ultimately, so any insights would be great.\"\n\n **The results?**  \n\n* The cover slide is terrible.  \n* The data on slide 2 is correct though, they have pulled out the correct numbers.  \n* And the accompanying text is helpful, if not super insightful.  \n* But they haven't really given me any info on the leadgen aspect.   \n* I can't use this internally, and certainly this isn't work fit for a client.   \n\nBut here is the rub. This new tech runs it's own computer, has access to any webapp I give it (and sign into), can write code, generate slides, use Excel, and operate on its own on complex tasks for 30-40mins. These slides took 19 minutes. \n\nSo yes this is basic intern work right now. And it needs to be better. Yes it is slow. Yes it needs hand holding. \n\nBut guess what? All real interns need that. And they are still out there in the real world doing valuable work. And so can ChatGPT Agent. \n\nAnd like a real intern it will get better at work, smarter and faster.\n\nBut unlike any human worker, soon it will get really really smart, really really fast, able to work 24\/7, and never get tired or sick or complain.   It won't do it lightening quick right now. It will ask you for a nudge along the way, and the deck won't be perfect (but will be better than 50% of people who make terrible decks for a living). But it will work. And it can chug away in the background why you do something else.\n\nAnd this is one use case. There are 100s of others:\n\n* Drafting campaign performance reports from multiple platforms\n* Updating buyer personas or ICP docs using CRM and call data\n* Creating competitor intelligence summaries from online sources\n* Rewriting landing pages for different personas\n* Pulling proof points for case studies or sales pitches from internal docs\n\nThere is a lot of hype around AI (duh!) but one thing as far as I can see is 100% the WAY we work is changing. Normal office workers need to skill up and learn how and why they can command an army of agents to do 70% of their day to day, and what that means for their now free time?\n\nAgain this is NOT about AI replacing humans. This is about what humans will be capable of when equipped with AI. Look at your job now. List the 10 most tedious things you do every week in your project management tools, or CRM, or your timesheet, or reporting tasks. Fire up a couple of instances of ChatGPT Agent, and get back to doing something that really moves the needle in your role. ",
    "created_utc":1752842115.0,
    "subreddit":"DigitalMarketing",
    "num_comments":15,
    "score":11,
    "sentiment":0.9972
  },
  {
    "id":"1lvfn29",
    "title":"Do you use Reddit for marketing your projects or products? If so, what tools do you use, especially AI-specific ones? If not, why not?",
    "text":"Hey fellow marketers, \n\nI'm curious to know if you utilize Reddit as part of your marketing strategy for your projects or products. If you do, I'd love to hear about the tools you find most helpful, especially any AI-specific ones. If not, could you share why that is?\n\nIn today's digital age, it's essential to stay updated with the latest marketing trends and platforms, and Reddit can be a powerful tool when used effectively. Its diverse communities offer unique opportunities for targeted advertising and engagement. However, I've noticed that some marketers might not fully leverage Reddit due to various reasons.\n\nFor those who do use Reddit for marketing, I'm particularly interested in learning about the AI tools you find most beneficial. These could range from content creation tools to AI-powered analytics platforms. Understanding how fellow marketers approach this platform can provide valuable insights and potentially inspire new strategies for all of us.\n\nOn the flip side, if you don't use Reddit as part of your marketing mix, I'd love to hear about any challenges or reservations that led you to make that decision. Your experiences can help shape the wider conversation about the role of AI in digital marketing on this platform.\n\nLet's share our insights and learn from each other! Feel free to ask questions, offer suggestions, or just engage in a thoughtful discussion about Reddit marketing strategies and AI tools. Looking forward to your responses!\"",
    "created_utc":1752058068.0,
    "subreddit":"DigitalMarketing",
    "num_comments":14,
    "score":5,
    "sentiment":0.9944
  },
  {
    "id":"1lr82ti",
    "title":"Need help getting clients and having a good payment model",
    "text":"Hello Reddit,\n\nI’m currently stuck and could use some advice. I just started a business called Elite Marketing Group. I recently secured a free internship with a fintech SaaS company called AskApe.ai after meeting the founder at a cafe. It’s unpaid, but it gives me access to tools like ChatGPT Pro and Claude for free, which I’m grateful for, plus I’ll get some good experience. That said, fintech isn’t the space I really want to work in.\n\nWhat I’m really passionate about is creating content for real estate agents and high-end restaurants. I have a DJI Avata 2 drone that shoots beautiful, high-quality videos, and I use an iPhone 15 Plus. I use the drone for a lot of my footage. One of my TikTok drone videos hit 120k views, so I know there’s potential. I edit mostly with CapCut, and I use Photoshop for graphic design work. I’m also decent with Canva, just starting to get into Lightroom, and I know a bit of Python that I’m hoping to apply somehow down the line.\n\nThe services I offer include content creation, social media management (I’m good with engagement, writing captions, and making viral content), graphic design (Photoshop, Canva, and AI tools), and photo\/video editing. I’m still learning and improving, but I feel confident in what I bring to the table.\n\nMy biggest challenge right now is finding paying clients and figuring out a good payment model. I’ve tried cold calling, but I’ve been told I come across as spammy, which definitely isn’t what I want. I’m open to doing initial work at a discount or even free if there’s long-term potential, but I just need a way to turn interest into consistent income.\n\nIf anyone has advice, tips, or even some work opportunities they’d be willing to throw my way, I’d really appreciate it. I can DM you a link to my site or portfolio if you want to check out what I’ve done.\n\nThanks in advance.\n\nTLDR\nStarted a creative agency and landed a fintech internship that gives me free AI tools. I want to work with real estate agents and restaurants instead. I have solid gear and content that’s gone viral, but I’m struggling to get clients and figure out a solid payment model. Any advice or leads would mean a lot.",
    "created_utc":1751597694.0,
    "subreddit":"DigitalMarketing",
    "num_comments":14,
    "score":5,
    "sentiment":0.9984
  },
  {
    "id":"1lqo3wp",
    "title":"how to rank your site in AI overviews",
    "text":"* write helpful content\n* structure it well\n* internal links\/backlinks\n* Pray 🙏\n\n(last one’s the most important)",
    "created_utc":1751545105.0,
    "subreddit":"DigitalMarketing",
    "num_comments":13,
    "score":6,
    "sentiment":0.807
  },
  {
    "id":"1llfgd8",
    "title":"Would AI making dedicated digital marketing team obsolete..??",
    "text":"Sorry guys I know this might be a little annoying, but I am genuinely curious about your thoughts: With AI becoming more powerful and accessible, do businesses really still need dedicated digital marketing teams?\n\nI've tested this idea by integrating AI into digital marketing strategies, and the outcomes have been eye-opening: efficient content creation, improved engagement metrics, and significant resource savings.... kind of shocking\n\nSo I'm keen to hear your thoughts:\n\n1. Do you see AI as a complement or a replacement for traditional digital marketing roles?\n2. How has AI influenced your marketing strategy and team composition?\n3. Are there tasks you believe AI can't replace?\n\nExcited to hear your insights!",
    "created_utc":1750981798.0,
    "subreddit":"DigitalMarketing",
    "num_comments":13,
    "score":0,
    "sentiment":0.9801
  },
  {
    "id":"1lg8gbk",
    "title":"8% of new user signups are coming from AI",
    "text":"This is the story of Webflow. Their SEO Lead has written an article about their findings and results.\n\nI'm only going to bring up the key points here, as they can be valuable insights to others too:\n\n* In October 2024 2% of Webflow signups came from AI. Fast forward to June 2025 and that figure has quadrupled: It is 8% now!\n\n\n\n* Webflow's strategy for showing up in AI consists of 2 main goals: Increasing brand visibility & optimizing owned content.\n\n\n\n* How are they actually executing their strategy? Automating content optimization with AI. They've automated some of these previously manual steps: \n   * Conducting keyword and competitor research\n   * Generating targeted content improvements while maintaining brand voice and messaging\n   * Including human-review checkpoints and editorial review\n   * Pushing finalized updates through an integration with the Webflow CMS\n\n  \nI've kept it really concise and focused on only the key takeaways.\n\nThe key ending message of that article is that everyone is learning AEO \/ GEO \/ AI SEO (whatever you wanna call it) together. \n\nSEO is not dead. It will be super relevant. As I see it, and because I am building an AI search tool to help solve this problem, AEO\/GEO is another step in SEO.\n\nAre folks here already taking action to optimize for AI search? Curious to know if you have any questions about the topic, happy to help as much as I can.",
    "created_utc":1750437136.0,
    "subreddit":"DigitalMarketing",
    "num_comments":13,
    "score":22,
    "sentiment":0.9868
  },
  {
    "id":"1lynrh9",
    "title":"ChatGPT + Canva = The easiest way I’ve found to make and sell digital products",
    "text":"You don’t need to be a designer, coder, or marketing expert to start making money online. I’ve been testing this combo: ChatGPT + Canva — and it’s honestly a super underrated AI-powered money machine.\n\nHere’s how it works:\n\n1. Use ChatGPT to generate content ideas, headlines, captions, product descriptions\n2. Use Canva to design everything fast with drag-and-drop templates\n3. Package it up → sell on Etsy, Shopee, your own site, or TikTok\n4. Or offer it as a lead magnet to grow your email list or following\n\n8 digital product ideas that are easy to make and sell\n\n1. Templates for online shops Social media posts, mini games, thank-you cards, vouchers Perfect for fashion, beauty, food, and lifestyle brands Price range: $2–$7 per bundle\n2. Content packs for creators and coaches Quotes, infographics, carousels, checklists, stories Useful for freelancers, educators, personal brands Can be sold or used to build your own audience\n3. Coaching kits Training slides, workbooks, templates Great for self-help, wellness, or finance coaches Adds a ton of professionalism and credibility\n4. Wellness and beauty packs Self-care guides, nutrition tips, meditation visuals Designed for yoga instructors, life coaches, beauty businesses You can bundle these into 7-day, 21-day, or 30-day kits\n5. Planner and self-care kits To-do lists, habit trackers, journaling prompts Perfect for busy professionals, women, personal development audiences Use as paid products or lead magnets\n6. Brand kits Logo sets, color palettes, typography, social media covers Best for influencers, small biz owners, or beauty brands You can offer in tiers: Basic, Pro, Premium\n7. Templates for Etsy, Shopee, or fan pages Product mockups, listing templates, SEO-optimized descriptions Great for shop owners and digital sellers ChatGPT helps you write high-converting listings fast\n8. Lead magnets Checklists, mini eBooks, how-to guides, slide decks Ideal for coaches, freelancers, mompreneurs Perfect way to attract leads and grow your email list\n\nIf you’ve been stuck overthinking how to start online — try this. Start with one simple product. You don’t need to go viral. You just need to launch something.\n\nChatGPT gives you the ideas. Canva gives you the design. The rest? Up to you.\n\nLet me know if you're building something similar or testing it out — happy to trade ideas.  \n",
    "created_utc":1752395119.0,
    "subreddit":"DigitalMarketing",
    "num_comments":13,
    "score":21,
    "sentiment":0.9973
  },
  {
    "id":"1m2bd2k",
    "title":"Everyone’s buzzing about AEO, GEO, AIO, and so many Os...",
    "text":"Everyone’s buzzing about AEO, GEO, AIO, and so many Os...\n\nBut after doing some deep research and study, I can say this..\n\n👉 It still all comes down to solid SEO fundamentals.\n\nWhat helps you rank on Google is also what helps you show up in ChatGPT, Perplexity, Claude, and other AI tools.\n\nBefore getting caught up in every shiny “AI visibility” trick, ask yourself:\n🤔 Are your basics right?\n✅ Strengthening your topical authority across core themes\n✅ Investing in link building - but for relevance, not just volume\n✅ Building trust signals across your content and site\n✅ Showing up everywhere LLMs crawl (not just your website)\n✅ Keeping your technical setup fast, secure, and crawlable\n\n📌 AI isn’t killing SEO. It’s rewarding marketers who master the fundamentals.\n\nLet’s focus on smart strategies that drive lasting results.",
    "created_utc":1752767921.0,
    "subreddit":"DigitalMarketing",
    "num_comments":12,
    "score":7,
    "sentiment":0.9711
  },
  {
    "id":"1lzfqw8",
    "title":"Has anyone started using llms.txt on their sites yet?",
    "text":"Now we’re seeing early discussions around llms.txt, a potential new standard for guiding large language models (LLMs) like ChatGPT, Claude, and Gemini. Kind of like a robots.txt, but built specifically for AI crawlers, with the idea of helping them find and index trusted content more accurately.\n\nSome are calling it a “treasure map” for LLMs — pointing to high-quality, permissioned content instead of letting them scrape the web blindly.\n\nI’m curious:\n\nHas anyone here implemented llms.txt on their site yet?\n\nAny early signs of impact — in terms of traffic, mentions, or inclusion in AI answers?\n\nAre LLMs even respecting it (yet)?\n\n\nIt’s still early, but if it picks up, this could be a big piece of how brands, publishers, and creators stay visible in AI-powered search results.\n\nWould love to hear your experience or thoughts if you're testing it!",
    "created_utc":1752476715.0,
    "subreddit":"DigitalMarketing",
    "num_comments":11,
    "score":4,
    "sentiment":0.9766
  },
  {
    "id":"1m275d2",
    "title":"Time to fire your social media marketing agency",
    "text":"A team of five, a bunch of meetings, and €5,000\/month to post three carousels. Sound familiar? Let's face it, the traditional model is (and has been for a while) broken. And honestly, it's not because of the individual agencies or the people. It's because the world has changed, and the agency model hasn't. \n\nOver the last few years, I've been talking daily with agency owners, social media marketers, project managers, account managers, copywriters, designers,...basically with the full 'value chain' of the traditional model, and they all say the same in some shape or form:\n\n* The model is completely outdated (because of AI), but it's still making enough money (for now). \n* Going 'core AI' would cannibalize their own business so hard that it might end it.\n\nNot necessarily intrinsic motivation for self-inflicted disruption, right 😉. \n\n# So what's wrong with the current SMM business model? \n\nWhen social media was new, agencies made sense. You needed experts, designers, planners, someone who knew the platforms. But fast forward to 2025, and here’s what we see:\n\n* Clients waiting weeks for a handful of posts\n* €3K–€10K monthly retainers for work that could be semi-automated\n* Endless rounds of feedback, strategy docs no one reads\n* Content that’s generic, slow, and disconnected from real-time trends\n* A growing dependence on external teams to speak on your behalf\n* Burned-out social media managers in agencies\n* No personality, no authenticity, no connection\n\nMeanwhile, AI tools are exploding. In-house teams are getting smarter. **Every client wants more ownership, speed, and control.** Agencies? They’re still stuck in 2017.\n\n# It's time for a new model for a new era\n\nThe 'billable hour, paying for input' model was already utterly flawed before AI came around. Yet there was no real alternative for the agency model. AND for some businesses working with an agency also meant getting access to expertise and not having to hire someone. \n\nAI really hit marketing as a domain front and center. It started with the production side of marketing (creating content), and quickly (not slowly) moved to more tactical and strategic parts too (content calendars, content strategy). Now that AI agents (agency vs. agents; not a coincidence) are becoming new virtual colleagues, the real displacement is happening. \n\nThese agents represent the **new model**. A model that helps busy teams and individuals do social media themselves. Fast, on-brand, and consistent. No endless back-and-forth. No retainers. No delay. Just real results, created in minutes, by you and your agents. Not by your agency. Here's what's happening already today:\n\n* Content strategy that evolves with the business all the time\n* Content calendars that get updated based on insights and analytics\n* Posts that get generated in your tone of voice for company and personal profiles\n* AI and automation that do 80% of the heavy lifting and repetitive work\n* Coaching by real domain experts when you need it. Autonomy when you don’t.\n* Always on, always available assistance whenever you need it, wherever you are\n* No bottlenecks. No meetings. No friction because of process or people. \n\n# Time to choose and set yourself up for the future\n\nIn 2025, *everyone* is a media company. And you can’t outsource your story. This isn’t about replacing people. It’s about replacing a way of thinking - that someone else should “handle” your voice online. They really shouldn't anymore. \n\nSo you can spend another quarter writing briefs, hopping on agency Zoom calls, and wondering why nothing is working.\n\nOR\n\nYou can join the post-agency era. where content gets created, shared, and amplified… without middlemen.\n\nAnd honestly? You shouldn’t be paying the price for a system that takes your time, your money, and your momentum - without delivering in return.\n\nWe’re at the edge of a massive shift, and those who move now will be the ones who lead tomorrow. Don’t wait for Q4 panic or a competitor to show up in your feed with a smarter, faster content engine. Use this summer to rethink how you do social media. Audit your current setup. Cut the dead weight. Experiment. Build your new rhythm that actually matches the speed of 2025 and beyond. \n\nThought, impressions, reactions, experiences, disagreements are super welcome!   \n",
    "created_utc":1752757832.0,
    "subreddit":"DigitalMarketing",
    "num_comments":11,
    "score":0,
    "sentiment":-0.9198
  },
  {
    "id":"1ls6l7y",
    "title":"I built 8 badass websites. The clients ghosted. You can have one.",
    "text":"I built 8 badass websites for people who hit me up asking for help. They seemed serious, said they needed sites ASAP, even gave details. I was low on cash and figured I’d prove myself, so I just started building.\n\nSpent days on these. Full sites. Not just templates. Like I actually made them functional and clean — mobile ready, custom copy, real UI, not that generic stuff.\n\nThen they just dipped. Ghosted. Some said they couldn’t pay, some just disappeared. No warning. Nothing. So now I’m just stuck with 8 damn websites sitting here doing nothing.\n\nThey’re solid though. I’ve got one for a crypto meme coin project, another for a drone service business. There’s a full-blown AI African marketplace, an AI language translation platform, a wedding planning site, one for a marketing content blog, one for a SaaS that helps businesses automate stuff, and even an aviation academy site.\n\nIf you want one, I’ll rebrand it to fit your business. Way cheaper than starting from scratch. Or if you want a custom one, I can still build it too, but yeah — I'd rather get these off my hands first.\n\nDM me if you’re curious. I’ll send previews. Just don’t ghost me too lol.",
    "created_utc":1751710389.0,
    "subreddit":"DigitalMarketing",
    "num_comments":11,
    "score":0,
    "sentiment":0.8818
  },
  {
    "id":"1m23gsm",
    "title":"Any suggestions??",
    "text":"Hey everyone!\n\nI'm looking for micro-influencers who'd review our tool- basically an AI agent that helps in social media visibility and growth.  \nBut I have no idea how to connect with such micro-influencers with such a specific niche, that too on reddit, any suggestions??  \nAlso, if any one is interested for this collaboration, please drop a comment here.  \nPS: please do not suggest any influencer marketing platform as I've tried those.",
    "created_utc":1752746215.0,
    "subreddit":"DigitalMarketing",
    "num_comments":11,
    "score":4,
    "sentiment":0.8339
  },
  {
    "id":"1lonets",
    "title":"Advice on..if I’m doing well and what I should be doing better.",
    "text":"Like the title suggests. I need advice or feedback on if I am going about everything the right way but also what I could be doing better.\n\nI opened my company in February of this year when I was laid off from what I thought would be my forever job.\n\nI honestly had no idea digital marketing was so saturated until I really started learning. I gained interest initially by helping local small businesses make websites, flyers etc. My peers kept telling me to go into marketing and well once I was laid off I dove in. \n\nCurrently I have one client on a monthly retainer which is… rough. A couple odd end website builds here and there. But no real traction on long term clients. \n\nFor my services I offer SEO\/GEO optimization for all platforms\nSocial media management and content production \nWeb design and development \nCanvassing \nVideo production\nPrint advertising\nPPC ads\nLogo and brand design\nAnd I CAN do it but where I am from AI is not quite accepted yet but custom AI agents and voice optimization and workflow automation.\n\nI have a weekly content calendar for my own marketing rotating between UGC, tips and tricks and regular organic ads. I am active on every platform and engage in communities. \nThe clients I have worked with have nothing but great things to say- and my long term client is extremely pleased with the results of my marketing. \n\nMy downfall is well. It’s just me. I am also not a great sales person. I also recognize I need better time management. I spend  lot of time trying to make everything absolutely perfect. \n\nOverall, I’ve got decent recognition for being sort of new, in ranking at 9 in my area on Google without any ads. \n\nBut.. the leads are none. I do pitch to small companies after I’ve done research and cross reference how my services could help them. I also go out in person with little gift bags of my flyers, brochures, tips for small businesses and a snippet on questions to ask marketers as well as a personalized and tailored card to the business. \n\nIt sounds insane I know to do all this by myself but I love working. I also really do believe in community marketing and have so much love for small businesses. \n\nI don’t know if this is normal for one person and to be a new company or if it’s me? (As far as leads go).\n\nSorry for the rant everyone. I’m just a bit discouraged. I’ve poured my heart and soul into this and I’m not giving up!! I just want to get better and figure out what I can do. \n\nThanks guys. ",
    "created_utc":1751328194.0,
    "subreddit":"DigitalMarketing",
    "num_comments":10,
    "score":4,
    "sentiment":0.996
  },
  {
    "id":"1lwreia",
    "title":"Marketing analytics challenge",
    "text":"I am planning to launch a 7 day challenge around marketing and product analytics\n\nIt is a simulation but data will feel real\nwhere you will get access to GA4, Meta Ads, Google Ads, Hubspot, or Shopify based on the case via AI\n\nOne question will unlock every day\nYou will have 24 hours to answer\nAccuracy and speed both matter\n\nEach challenge will have a goal\nCould be revenue growth, lead generation, brand awareness or fixing issues etc.\n\nBy end of it you will solve a business problem using data\n\nIt is built to help you think like a data driven marketer\n\nWinners will get rewards and maybe even hired by me or my clients\n\nI will only do this if enough people show interest",
    "created_utc":1752189491.0,
    "subreddit":"DigitalMarketing",
    "num_comments":9,
    "score":6,
    "sentiment":0.9721
  },
  {
    "id":"1m1hcdl",
    "title":"Any AI tools that can handle marketing design tasks for small clients?",
    "text":"I’m a marketing consultant, mostly focused on strategy and growth not design.\n\nBut here’s the thing:  \nA lot of my smaller clients often ask me to create **flyers, social media posts, or basic marketing visuals**. I get it they don’t have a designer, and they trust me. But honestly, it’s **time-consuming work** that I can’t charge much for… and at the same time, I don’t want to say no and risk losing the relationship.\n\nI’ve used Canva and Photoshop, but every time I open them, I lose lots of time average 30min per image and revision loops\n\nI’m looking for an **AI tool** that can:\n\n* Quickly generate **designs** from prompt\n* Handle **multiple dimensions** \n* Ideally allow basic **branding alignment** (logo, color use, etc.)\n\nHas anyone here found a tool that actually delivers that?  \nI’m looking for something that lets me **save time, keep the client happy, and stay focused** on high paying clients. ",
    "created_utc":1752683574.0,
    "subreddit":"DigitalMarketing",
    "num_comments":9,
    "score":0,
    "sentiment":0.9794
  },
  {
    "id":"1li9duy",
    "title":"What is your marketer tech stack?",
    "text":"I think we’re the group always chasing better, new ways to produce better ROI lol. But after all those tools, what actually stuck with you? After trying a ton of stuff, here’s what actually use daily and helps me stay productive\n\nGeneral\n\n* ChatGPT for brainstorming, content creation, deep market research. Quite embarrassing, but can’t imagine my life without it\n* Google sheet: Still the OG for planning campaigns, budgeting, and even tracking CRM stuff\n\nMarketing\n\n* CapCut - Pretty solid free video editor for social content. But there's some changes with its T&C so I'm looking at alternative like Canva\n* Blaze AI - Trying this out to create marketing content faster.\n* Linked Helper - To automate the reach out on LinkedIn. Quite powerful, but still a risky game since LinkedIn detects bots quite rapidly\n\nProductivity\n\n* GCal - Does the job for scheduling meetings and blocking time for deep work. Nothing fancy but works.\n* Fireflies AI - For meeting notes. Pretty popular, does the job decently\n* Saner AI - I dump all my notes, docs, and todos here. Love that I can just chat with it to schedule or organize the tasks.\n* OneSec - Puts a delay on social apps to stop me from mindlessly opening them outside of work. Weirdly effective for my ADHD\n\nTell me your tech stack!",
    "created_utc":1750659749.0,
    "subreddit":"DigitalMarketing",
    "num_comments":8,
    "score":4,
    "sentiment":0.9855
  },
  {
    "id":"1lk2vdg",
    "title":"SEO news: Google now includes AI Mode data in Search Console performance reports, Live voice chat with AI now available in Google Search Live, AI Mode appears in “People also ask” and Chrome suggestion box",
    "text":"Hey guys, we’ve put together a news roundup to help us all stay up to date with the latest industry updates:\n\n**GSC**\n\n* **Google now includes AI Mode data in Search Console performance reports**\n\nGoogle confirmed that clicks, impressions, and average-position data from AI Mode are now folded into Search Console’s Web performance metrics. Because the figures are merged with standard search data, there’s currently no filter to isolate AI Mode results.\n\n**Source:**\n\nGoogle Search Console > Help Center\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**AI**\n\n* **Live voice chat with AI now available in Google Search Live**\n\nAs part of the Search Labs experiment, Google has rolled out Search Live in the Google app for Android and iOS. \n\nUsers can have real-time voice conversations with the Gemini-powered assistant: ask questions aloud, listen to spoken answers, and keep the dialogue going while links and a transcript appear on-screen. A camera\/visual input option is planned for the coming months.\n\n* **(test) Audio AI Overviews now being tested in Google Search**\n\nGoogle is testing audio versions of AI Overviews in the United States. A new ‘*Listen’* button plays a spoken summary (English only) but omits source attribution. \n\nUnless users scroll to the links section, they won’t see where the information originates—even though the narration draws wording and facts from specific sites.\n\n* **John Mueller: “No AI system uses llms.txt”**\n\nJohn Mueller clarified that no current AI models consult an llms.txt file when deciding what to crawl or index. He added that platforms such as WordPress already generate XML sitemaps, so llms.txt is optional.\n\n* **(test) AI Mode appears in “People also ask” and Chrome suggestion box**\n\nGoogle is now testing AI Mode in two new places: within the People also ask section and in the Chrome omnibox search suggestions. Google is also surfacing AI Mode answers in two new places: inside the People also ask module and in Chrome’s omnibox suggestions.\n\n**Source:**\n\nGoogle The Keyword > Product > Search\n\nJohn Mueller | bsky\n\nJH Scherck | X\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Documentation**\n\n* **How to block content from appearing in Google’s AI Features**\n\nA new Google guide explains how to keep content out of AI-generated results. It covers using *robots.txt*, meta tags such as *<meta name=\"googlebot\" content=\"nosnippet\">*, and the *data-nosnippet* attribute to control what Google can fetch or display. \n\nGoogle reiterates that the *noindex* directive remains the most reliable way to keep pages out of the index, and warns that misconfigured directives may block only snippets or certain queries instead of entire pages.\n\n**Source:**\n\nGoogle Search Central > Documentation \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Local SEO**\n\n* **Google Business Profiles rolls out a new interface for posts**\n\nA new scrollable interface has been introduced to Google Business Profiles, allowing users to view their historical Google Posts in a more streamlined, list-style format. \n\n**Source:** \n\nAnabel L. | LinkedIn\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**E-commerce**\n\n* **Website-reported autofeeds now available in Merchant Center**\n\nGoogle Merchant Center has introduced a feature called \"Website‑Reported Autofeeds\", which lets merchants automatically send live in‑store inventory updates via a Google Tag Manager tag instead of uploading separate feed files.\n\n* **Merchant Center interface adds smarter shopping insights**\n\nGoogle has revamped the Merchant Center dashboard with a new “Opportunities” page\". The interface now groups actionable tips:\n\n* adding missing images\n* improving item descriptions\n* increasing bidding for easy prioritization \n\nAdditionally, merchants can filter opportunities by category, goal impact, or urgency, helping them tackle the most valuable improvements first.\n\n**Source:** \n\nEmmanuel Flossie | LinkedIn\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Tidbits**\n\n* **OpenAI enhances ChatGPT search with smarter, longer, and visual responses**\n\nOpenAI has introduced several enhancements to ChatGPT Search, including the ability to deliver more comprehensive and up-to-date responses. It now handles longer conversational queries with improved context awareness and follows complex instructions more effectively. \n\nFor difficult questions, ChatGPT can run multiple searches automatically and support image-based queries by allowing users to conduct searches using uploaded images.\n\n**Source:** \n\nOpenAI > ChatGPT - Release Notes",
    "created_utc":1750849969.0,
    "subreddit":"DigitalMarketing",
    "num_comments":8,
    "score":17,
    "sentiment":0.9896
  },
  {
    "id":"1lpl481",
    "title":"Feeling of ambiguity when it comes to digital marketing.",
    "text":"I have read a lot of successful stories on Digital marketing agencies and how fast they could grow. But I still don’t understand how do you get in to this?  And more importantly, what exactly specifically is they do, and who they help? It’s very broad.\n\nI am a little knowledgeable in creating a campaigns on Instagram and Amazon, and I would describe myself as amateur. Like someone who had a chance to fool around with some small business ideas and create barely successful adds with my own products that eventually I stopped because it wasn’t worth my time. And I think I can quickly figure out how to create campaigns on different platforms. And that led me to think maybe I quickly can get into digital marketing business… Currently I work in car sales and at a point  that I am sure I can build great relationships, rapport with people and sell myself. And I understand that I want to genuinely help people no matter what I am selling. But what kind of people are usually agencies helping? What niche is good right now? Is it better to just focus on one specific thing? \n\nI was thinking about creating a software using AI that helps health practices organize communication with new clients, respond to messages, navigate and set up appointments. Kinda like CRM? But it isn’t really a digital marketing though? Or maybe help people like physical therapists, food catering businesses, other service providers find new clients? But I probably also need to help them handle and organize clientelle that I find for them, isn’t that how it works? Like customer service, communication response etc. Thats why I am confused. \n\nAlso where do I find leads that my clients need? Can I just launch bunch of targeted instagram campaigns? Or can I find leads through other providers? Do I just resell them to my clients? Is that how it works? And once I submit people I found for my clients, do I just let them handle leads, or do I try to sell their services myself to the same leads that I found…\n\n\nThats all assuming I already created a shell of my brand like LLC, Website, social media pages and etc. Which I didn’t even start (except for llc which I have from previous failed business).\n\nLets say I got my first client, and they put in order, I run a successful instagram\/facebook ad that will find new clients, then question is how do I charge my client? For every appointment, or lead that came through? And again do agencies usually do anything else than create a mine a list of people who maybe interested in client services? Or are digital agencies are more in creative business like creating ad videos, marketing materials, brochures etc? So do I need to buy camera, graphics design software etc? \nSo I don’t even understand what to even focus on in this “DIGITAL MARKETING AGENCY” umbrella because I can’t seem to get what y’all do… because my assumption is even though you all who own a business with the same name do completely different things from each other… creating ad campaings, or ad materials? Or creating software for clients, and integrating your own lead pipeline into that software, maybe that? \nAnd how do I even find people that need my help? Do I just go around my town and try to find them? So many questions and my head feels so disorganized, I don’t even know where to start because I feel paralized by the options. Anyone else without experience also feels the same way? ",
    "created_utc":1751425251.0,
    "subreddit":"DigitalMarketing",
    "num_comments":8,
    "score":6,
    "sentiment":0.9984
  },
  {
    "id":"1lhptqu",
    "title":"5 Marketing Automation Tools That Help Me Work Smarter",
    "text":"As a digital marketer managing content across several platforms, I rely on a few tools to keep things organized and efficient. Here are five that have made a noticeable difference in my workflow:\n\n1. Cloud Campaign – This has been a solid solution for managing social media, especially across multiple brands or clients. It covers scheduling, recycling older posts, caption writing with an AI assistant, analytics, and even connects with Zapier for more complex automation. It’s built for teams, but still works well for solo users handling a lot of content.\n\n2. ActiveCampaign – Great for email automation and CRM. I use it to set up automated workflows, manage contact lists, and send targeted campaigns. It integrates easily with platforms like Shopify and WordPress, which makes life easier.\n\n3. BigSpy – Super helpful for ad research. It lets you monitor what competitors are running on Facebook, Instagram, and TikTok. It’s a good way to stay inspired and keep an eye on trends.\n\n4. VDraw – A lightweight tool that turns text into infographics. It’s not a full design suite, but it’s fast and gets the job done when I need quick visuals for social or blog content.\n\n5. Taboola’s Abby – An AI assistant for creating ad copy and picking visuals. It’s not flawless, but it helps speed things up when building campaigns, especially if you're short on time or resources.\n\nThese tools each solve different problems, and together they've helped me cut down on repetitive work. I would love to hear what others are using too.",
    "created_utc":1750604131.0,
    "subreddit":"DigitalMarketing",
    "num_comments":7,
    "score":11,
    "sentiment":0.9928
  },
  {
    "id":"1lvq7b5",
    "title":"Is Digital Marketing Still Worth It in 2025? (Honest Discussion)",
    "text":"With AI-generated content flooding the web, algorithm changes happening monthly, and ad costs skyrocketing. I’ve got to ask:\n\nIs digital marketing still a viable career\/business strategy in 2025?\n\nHere’s what I’m seeing:\n\nSEO: Google’s “Helpful Content” update now penalizes over-optimized pages (RIP 80% of affiliate sites)\n\nSocial Ads: Meta’s CPMs doubled this year thanks to AI ad spam\n\nEmail: Open rates dropped 30% since Gmail’s new auto-sorting\n\nBut there’s hope:\n✅ Niches like local service businesses are crushing it with hybrid strategies\n✅ Dark social (DMs\/private groups) is the new organic growth hack\n✅ Tools like ViralRabbi’s AI Shield help bypass content detection\n\nDiscussion Points:\n\nAre you pivoting strategies this year? How?\n\nWhat’s working for you right now?\n\nAre we all doomed or just adapting?\n\nPS: If you’ve survived the 2025 apocalypse, drop your best tip below!\n\n",
    "created_utc":1752085375.0,
    "subreddit":"DigitalMarketing",
    "num_comments":7,
    "score":0,
    "sentiment":0.9678
  },
  {
    "id":"1lvg948",
    "title":"Are AI citations the new currency? If yes, how can you track them?",
    "text":"I recently came across ahrefs Brand Radar and AI overviews feature that help you track long-tail queries to cite in your content and LLM mentions across ChatGPT, Perplexity and Gemini.\n\nMy question: Is organic traffic obselete? Are plummeting clicks not the reflection of the quality of content anymore. As zero click content is becoming the audience focus, I can see organic search results, even the ones that are doing really well on SERP, not getting any clicks and way too many impressions. Traffic, as much as signals the actionability of content, stands still in comparison to AI citations? AIOs and LLMs have taken over, completely., though people still use Google for browsing.\n\nMarketers, what are your thoughts on this. Generating AI content for social media, blogs, ads and videos never seemed good to me, as the quality will always be subpar. But, I need some answers here, lest I keep staying relavant to marketing as a whole. Also, Is GA session traffic an indicator of the conversion potential? or is it just limited to paid marketing tracking?",
    "created_utc":1752060184.0,
    "subreddit":"DigitalMarketing",
    "num_comments":6,
    "score":1,
    "sentiment":0.4124
  },
  {
    "id":"1lg22o6",
    "title":"Please urgent help",
    "text":"So actual marketing agency owner no o online gurus i need your help\n\nIam a 17 year old war immigrant currently in egypt\n\nAfter escaping a goddman warzone and seeing smelling death i realized how short life is and started finding my purpose in life after month I finally realized that i can never get a 9-t iam not built for it i love hardwork building products services providing value using levrage and so i fell into the internet rabbit hole\n\n  Of the digital marketing agency space around an year ago i spend months studying marketing human psycology behaviroal psycology sales persuation ai automation gohighlevel, email marketing, copywriting etc do a point where iam confident that i can get clients results\n\nProblem is i have no testimonials\n\nAll i have is a laptop, mic, webcam, website proffisional domain and proffisional email\n\nSo guys do you think i can really start my digital marketing agency targeting home remodeling companies small to mid sized my offer is building an ai system that books 5-15 estimates every month without you lifting a finger\n\nThe service is lead generation via fb ads ai sms follow up vua highlevel then lead calling and appointment setting via myself or appointment setter\n\n\nMy problem is iam sure my system works i just hit no testimonials what to do\n\nOne idea i have is leveraging a big marketing agency case Studies them breaking it down for potential clients on sales calls them showcading hwo i can emulate them into their business\n\nOr working as a cold caller\/appointment setter for a marketing gencu to get money to Be able to pay for gohighlevel and pay my first 3 cleints ad spend to get testimonials\n\nDo you think them strategies will work and if not please give me a blueprint to implement today please i would be very grateful thank you all in advance",
    "created_utc":1750420387.0,
    "subreddit":"DigitalMarketing",
    "num_comments":6,
    "score":0,
    "sentiment":0.7656
  },
  {
    "id":"1lw9z8m",
    "title":"Less replies on Sales Navigator. Help please.",
    "text":"I am working for a tech company as Digital Marketer. For the past month I have been sending personalized messages with the help of chatGPT and the \"draft with AI\" feature in Navigator on how our company can be of use for yours.\n\nIn the last week, I changed my approach and made a company specific PDF of use cases on how the tech that my company provides can help yours.\n\nI have sent over 100 messages (5-8 employees per company) who are senior management of the company. I have barely got 5-6 replies out of which half were \"not interested\".\n\nThis is an example message that I have sent. Please help me how can I improve on some leads:\n\nSubject: Modernizing PLM & Engineering Systems with Agentic AI\n\nHi \\[First Name\\],\n\nI’m sharing a short PDF created specifically for \\[Company Name\\]— it outlines 5 high-impact use cases where Agentic AI and RPA are streamlining operations across product development, warranty, compliance, and supply chain.\n\n\\[PDF Link (LinkedIn Smart Link)\\]\n\nAs Director of PLM and Product Development Systems, I thought this would be particularly relevant — especially as teams look to accelerate change requests, improve design-to-launch timelines, and reduce manual coordination across systems.\n\nWe’ve worked with leading automotive OEMs and suppliers to deliver:\n\n  • 50% faster engineering change approvals  \n  • Root cause clustering in warranty analysis tied to product batches  \n  • Automated compliance and documentation tracking across BOMs and specs  \n  • Seamless integration of RPA\/AI into PLM, ERP, and QA ecosystems\n\nAt AventIQ, we specialize in building intelligent automation layers that integrate with complex PLM systems — enabling proactive, compliant, and scalable product development.\n\nWould love to connect for a quick 15–20 min conversation to explore how this could support your current initiatives.",
    "created_utc":1752145772.0,
    "subreddit":"DigitalMarketing",
    "num_comments":6,
    "score":2,
    "sentiment":0.9883
  },
  {
    "id":"1lwbhlj",
    "title":"SEO News: Cloudflare blocks AI crawlers by default, EU publishers file antitrust complaint over AI Overviews, ‘Noindex’ no longer blocks JavaScript rendering by Google",
    "text":"Okay colleagues, skipping this week’s marketing news? No way.\n\nIt’s boiling out there, but the real heat is in what’s going on in our industry. Let’s dive in and see what’s got everyone talking:\n\n**SERP features \/ Interface**\n\n* **AI Overviews power 12.6% of People Also Ask answers**\n\nA recent analysis reveals that only 12.6% of Google's \"People Also Ask\" boxes are now being answered with AI Overviews. While some assumed AI was taking over PAA results, the vast majority—87.4%—still display traditional featured snippets that cite and link to publishers’ websites.\n\n* **(test) Google experiments with price snippets directly in search results**\n\nGoogle is testing a new snippet format for product searches: price tags now appear directly in snippets and can specify if the price is low, high, or typical, without needing to click through.\n\nWhen clicking on the extension, a popup displays specifying that insights are based on the last 90 days, with the rich result appearing differently on mobile.\n\n**Source:**\n\nMark Williams-Cook | LinkedIn\n\nBrodie Clark | X\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**GSC**\n\n* **Search Console Insights report gets refreshed with deeper context**\n\nA revamped Search Console Insights tab is now part of the main GSC dashboard. It integrates more tightly with the Performance report and introduces time-range comparison, allowing SEOs to quickly view trends versus previous periods. \n\nThe report maintains cards for clicks, impressions, top content, and trending queries—streamlining workflow and helping pinpoint content opportunities. \n\n**Source:**\n\nGoogle Search Central Blog\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**AIO \/ AI Mode**\n\n* **AI Mode promoted with animated homepage visual**\n\nAn animated logo on the Google homepage in the U.S. is now highlighting the “AI Mode” search experience. Clicking the animation takes users directly into AI Mode search results.\n\n* **(test) AI Mode button appears in Chrome’s address bar on desktop and Android** \n\nA new AI Mode button appears directly in Chrome’s omnibox—on both desktop and Android devices in the U.S. and India. When tapped, this button immediately launches the AI-powered search interface.\n\n**Source:**\n\nSachin Patel | X\n\nBarry Schwartz | Search Engine Roundtable\n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**Tech SEO**\n\n* **Cloudflare blocks AI crawlers by default**\n\nCloudflare has made a major shift: now AI-focused bots are blocked by default across all new domains, unless site owners explicitly allow them. \n\nAlongside this change, Cloudflare is launching a Pay Per Crawl program. Publishers can now charge AI firms for crawler access.\n\nThe initiative also includes updates to Cloudflare Radar: site owners can now see how often AI models crawl their pages versus how much referral traffic those crawls generate, helping them make informed decisions about access and pricing.\n\n* **‘Noindex’ no longer blocks JavaScript rendering by Google**\n\nUntil recently, Google skipped rendering JavaScript on pages marked with noindex. However, new tests show that Google now fully renders noindex pages, executing JavaScript and even fetching dynamic content via POST requests, while still not indexing the page.\n\nThis shift means that sites using noindex to block pages may still see those pages rendered and crawled despite being excluded from the index. \n\n**Source:**\n\nMatthew Prince | Cloudflare Blog\n\nDave Smart | TametheBots \n\n**\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_**\n\n**Tidbits**\n\n* **Bing places Copilot search as default tab in desktop and mobile**\n\nMicrosoft has updated Bing to make its Copilot-powered search tab the default experience on both desktop and mobile. This change places AI-assisted answers front and center—users now land first in the Copilot tab, while traditional “Search” and “Chat” tabs are pushed to secondary positions.\n\n* **EU publishers file antitrust complaint over AI Overviews**\n\nA coalition of independent publishers filed an antitrust complaint with the European Commission. They argue that Google misuses its dominance by placing AI Overviews above traditional search results, diverting traffic and revenue from publishers. The groups also criticize the lack of an opt-out option for using their content in these summaries without affecting visibility. \n\n**Source:**\n\nSachin Patel | X\n\nReuters\n\n",
    "created_utc":1752150608.0,
    "subreddit":"DigitalMarketing",
    "num_comments":5,
    "score":12,
    "sentiment":0.699
  },
  {
    "id":"1ltkxqk",
    "title":"Need help marketing a voice AI Based Sales Outreach Service",
    "text":"Hey all,  \nI recently started an agency that builds and deploys voice-based outreach systems  mostly for  service based businesses. It handles both outbound (calling large lead lists, qualifying, booking appointments) and inbound (answering calls, basic info, routing).\n\nThe tech works really well clients are saving time and closing more leads  but I'm hitting a wall when it comes to marketing it.\n\nWhat would be a smart way to position or promote something like this? Agencies? Direct to SMBs? Any ideas welcome.",
    "created_utc":1751862219.0,
    "subreddit":"DigitalMarketing",
    "num_comments":5,
    "score":3,
    "sentiment":0.9606
  },
  {
    "id":"1lgeha3",
    "title":"What’s your process for turning ad performance insights into new ad creatives?",
    "text":"Manual analysis and new briefs? Has anyone found a helpful AI-assisted solution? Or are we trusting the gut feeling?",
    "created_utc":1750452044.0,
    "subreddit":"DigitalMarketing",
    "num_comments":4,
    "score":4,
    "sentiment":0.8504
  },
  {
    "id":"1m0xjdv",
    "title":"Work life balance -spouse perspective",
    "text":"I’m the spouse of a digital marketing professional.   A little over a year ago my spouses company decided to post on TT and insta daily. They post twice daily normally. \n\nThis was a bit of change for me as a spouse and I’ve been struggling with meaningful connection with my spouse since.  I’m struggling with never being able to turn work off. My spouse doesn’t understand why it impacts me as I’m not the one having to post. However, the disconnection occurs because in moments that used to be filled with conversations or listening to music in the car etc are now filled with posting while we are driving or out, in between free moments,or late at night when you should be having pillow talk. My spouse doesn’t understand why it upsets me and tries to do it quickly, but there always seems to be issues. Some sound doesn’t work, a graphic is cutoff etc. What should be 30 minutes turns into 3 hours, though it is off and on…not three hours constant. My spouse texts the team, they decide what to do. It has to be approved, then the post finally happens and you have to wait for it to upload and move onto the next platform. \n\nI also have an extremely demanding job, though I try to not let it spill over into the weekends or nights. It certainly does sometimes, but it has becomes the exception or a true emergency. With the daily posting, I feel like even though we are together, my spouse is not present. I can’t express the joy in dumping 250 on a steak dinner and her team texting during dinner which elicits a response and back and forth to deal with some comment or issue. \n\nI thought it would get better as I was told eventually they’d be able to schedule them. Apparently their numbers drop when they do and my spouses boss called them out on that. So my spouse manually posts, then interacts with the app after posting to help the algorithm and show engagement. Meanwhile I hear videos rewind, as my spouse tweaks the AI captioning and moves things around. \n\nMy spouse says it is a 24\/7\/365 job. Surgeons do not work this much. I’m so tired of the constant attention social media gets. Both of my kids complain but they are too scared to address it with my spouse and just tell me every so often, though I don’t think it impacts them as much as myself. I feel like every free moment is spent trying to tweak things or answer coworkers or comments in every down moment (go walk the dog—aka so you don’t see me responding to posts).  Extra long bathroom breaks, doom scrolling. It has gotten to the point that even if that is not what’s happening, my mind thinks it is. Then before bed my spouse unwinds by scrolling FB and news. \n\nMy soul is screaming for connection and my spouse doesn’t understand what the big deal is. In my spouses mind we are with each other and it is just posting so what is the big deal. I asked to be able to take vacations without posting and was told it wasn’t possible. I’d really love to have one day a week with zero SM. \n\nCan someone provide me with some perspective from those in the field. I feel like it is reasonable to be able to disconnect for one day a week. If it is how do you accomplish it? How do I address it?  I’m tired of waking up in the middle of the night feeling of such despair that the rest of my life is going to be like this. ",
    "created_utc":1752622935.0,
    "subreddit":"DigitalMarketing",
    "num_comments":4,
    "score":3,
    "sentiment":0.9643
  },
  {
    "id":"1lj7h8z",
    "title":"I've helped 50 B2B businesses in the past 6 months.\n\nHere are the 7 B2B marketing tactics to run in 2025:",
    "text":"1. Publish high quality content at scale on multiple channels and formats. It's the tactic with the highest ROI right now so start, iterate, and scale the system.\n\n\n\n2. You need an internal knowledge center and content repurposing system to sustain your creation need. It's the only way to keep up with the content flow.\n\n\n\n3. Your internal marketers (or founders if early stage) should become full-stack AI marketers. So they can automate repetitive tasks and focus on strategic ones.\n\n\n\n4. Install a system that collects, consolidates, and analyzes intent. So you can finally connect content to your outbound system.\n\n\n\n5. Use AI to strengthen your audience feedback loop and run surveys. Get clients feedback, analyze sales calls, listen to social media, analyze reviews...\n\n\n\n6. If possible, build an offer portfolio to increase your clients retention and LTV. Stay known for one signature offer but stack revenue\n\n\n\n7. Control your positioning by keeping a consistent messaging strategy across channels and also across time. Your prospects will need a lot of repetition before they actually trust you (so don't change every 2 months).\n\n\n\nDo this and you increase drastically your chances of success.\n\n",
    "created_utc":1750760664.0,
    "subreddit":"DigitalMarketing",
    "num_comments":4,
    "score":11,
    "sentiment":0.9628
  },
  {
    "id":"1lo7rak",
    "title":"AI Marketing Buzz: AI Mode data in Search Console, Google’s tips on blocking content from AI Mode & AI Overviews, and more thoughts on Sundar Pachai interview",
    "text":"Happy Monday! We’ve rounded up the top AI updates from last week, perfect fuel for your marketing strategy this week. Let’s dive in and see what’s worth applying:\n\n* **Brodie Clark:** ***“Based on my experiment, I do believe that AI Mode data is now showing in Search Console”***\n\nBrodie Clark recently analyzed the latest changes in Google Search—focusing on AI Mode, AI Overviews, and how they compare to traditional search results. In his new study, titled \"AI Mode Tracking in Google Search Console Confirmed \\[SEO Experiment\\]\", he shared several key insights and followed up on social media with a summary of the most valuable takeaways:\n\n*Average position in Google's AI Mode takes more of a sharp-left compared to the zig-zag of a traditional search results page.*\n\n*This approach tends to be more simplified in mobile search results (where the sequence is clear), with there being rules put in place for desktop that complicate data interpretation.*\n\n*The major distinguishing feature of AI Mode is the primary sources featured on the right, which may lead some to follow Google's zig-zag approach to average position – because this is what is referenced in their docs.*\n\n*Search results have evolved quite a bit since many of these position calculation rules were put in place, with AI Overviews within the main tab of Search essentially matching that of AI Mode by featuring multiple visible citations by default that record the same position.*\n\n*All of this aside, the major difference is in what the \"10-blue-links\" equivalent is. Taking Google's docs into account, depending on whether it is a dotted underline (which is different) or not, then this would essentially take on its own position with the data.*\n\n*Does this make sense? Probably not. Because position 3 in traditional results would likely have a reasonable CTR. Within AI Mode? That same position 3 is less important within the context of the page and less prominent, so clicks are going to be far lower.*\n\n*So without any filter for AI Mode itself in Search Console, we're left with mixing 2 completely different datasets into one. But with how much a \"traditional\" search results page has changed in recent years, this has effectively been happening for even longer.*\n\n**Source:**\n\nBrodie Clark | Blog, X\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* **Google adds troubleshooting tips on blocking content from AI Mode & AI Overviews**\n\nBarry Schwartz is dropping some major insights for SEOs. Google quietly revised its AI-features help documentation—released less than a month ago—by adding a section on troubleshooting preview controls. In short, if you want to keep your pages out of AI Overviews, AI Mode, or other AI features, these steps will help.\n\nThe new section states:\n\n*If you implemented preview controls and you're still seeing your content appear in AI features on Search, try the following steps:*\n\n*1) Make sure that the preview control is correct and visible to Googlebot. To test if your implementation is correct, use the URL Inspection tool to see the HTML that Googlebot received while crawling the page.*\n\n*2) Allow time for Google to recrawl and process the change in preview controls. Remember that crawling can take anywhere from several days to several months, depending on how often our systems determine a page needs to be refreshed. If you've made changes, you can request that Google recrawl your pages.*\n\n**Sources:**\n\nBarry Schwartz | Search Engine Roundtable\n\nGoogle Search Central\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n* **The SEO community continues to discuss Sundar Pichai's interview**\n\nHere are the main points:\n\n* **Google reiterates its commitment to the open web.** In a recent conversation with Lex Fridman, Pichai said Google **“remains dedicated to supporting the broader web ecosystem,”** even as new AI-powered features—AI Overviews and AI Mode—roll out.\n\n* **AI Overviews and AI Mode are meant to augment, not replace, human content.** Pichai explained that these tools provide extra context and prompt deeper exploration. He acknowledged publishers’ worries about traffic loss but stressed that **news and journalism remain “essential elements” of Google’s long-term vision.**\n\n* **Advertising will adapt once the organic AI experience is perfected.** For now, Google is refining AI Mode as a separate tab; **successful elements will migrate into the main results page later.** Pichai confirmed that ads will stay central to Google’s model, just on an AI-ready timetable.\n\n**Sources:**\n\nLex Fridman | YouTube\n\nRoger Montti | SE Journal\n\nScott Shorter | X",
    "created_utc":1751290701.0,
    "subreddit":"DigitalMarketing",
    "num_comments":4,
    "score":18,
    "sentiment":0.9915
  },
  {
    "id":"1lfvvca",
    "title":"Google’s AI Mode Goes Nationwide — No Login Required",
    "text":"The future of search arrived quietly this week. Google's AI Mode is now rolling out to every U.S. searcher, even those browsing incognito.  \n  \nThis isn't just another AI feature. AI Mode fundamentally rewrites how search works.  \n  \nInstead of showing you ten blue links, it deploys \"query fan-out\" system.  \n  \nThat means it fans your question out into multiple sub-queries across various sources, then stitches everything into comprehensive, reasoned answers.  \n  \nThink of it as having a research assistant who can instantly cross-reference dozens of sources while you wait. Pretty amazing, huh?👌👌  \n  \nWhat makes this game-changing:  \n  \n↳ Works without sign-in (goodbye, privacy barriers)  \n↳ Multimodal search with text, voice, and images  \n↳ Conversational follow-ups that remember context  \n↳ Automatic depth analysis for complex queries  \n  \nThe kicker?  \n  \nYour Search Console data is about to get messy. Google is lumping AI Mode metrics with traditional web search, meaning your traffic reports just became a lot harder to interpret.  \n  \nWhy this matters:  \n  \nGoogle isn't testing AI Mode—they're replacing traditional search with it. Region by region, query by query, the old Google is disappearing.  \n  \nThe question isn't whether AI search will dominate. It's whether you're ready.",
    "created_utc":1750396633.0,
    "subreddit":"DigitalMarketing",
    "num_comments":4,
    "score":16,
    "sentiment":0.9587
  },
  {
    "id":"1lrh2yk",
    "title":"SEO News: Google’s June 2025 core update rolls out globally, AI Mode expands to India as part of global rollout, Google's MUVERA algorithm improves semantic relevance in search",
    "text":"Hi friends! Our team never stops for a second—we’re constantly tracking the latest news for you. So let’s dive in together and maybe adjust our strategies to match the shifting market.\n\n**Updates**\n\n* **Google’s June 2025 core update rolls out globally over three weeks**\n\nGoogle officially began the June 2025 broad core update on June 30 and will likely complete it over the next three weeks. This update is classified as a \"regular update\" designed to surface relevant, satisfying content across all languages and regions. It follows previous core updates, including those in March, December, and beyond.\n\n**Source:** \n\nGoogle Search Status Dashboard > Incidents\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Search\/SEO**\n\n* **Google's MUVERA algorithm improves semantic relevance in search**\n\nThe new MUVERA algorithm (Multi‑Vector Retrieval via Fixed-Dimensional Encodings) improves how search understands and ranks content. It speeds up retrieval and boosts accuracy by compressing complex multi-vector signals into efficient representations.\n\nHere’s how SEOs should respond:\n\n* Focus on semantically rich, well-structured content.  \n* Optimize for intent-based, long-tail queries.  \n* Move beyond keyword-stuffing toward topic depth and clarity.\n\nMUVERA marks a shift toward smarter, more context-aware search.\n\n* **URL extensions don’t affect SEO**\n\nJohn Mueller reaffirmed that choosing between using *.htm, .html,* or no extension in your URLs does not impact SEO. \n\nHe explained that file extensions are purely historical. Extensions are irrelevant to Google’s ranking algorithms, (this advice has held true for several years). Mueller also noted that while extensions don't matter, URL structure still impacts user experience, tracking, and site organization.\n\n**Source:**\n\nRoger Montti | Search Engine Land\n\nJohn Mueller | Reddit\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**SERP features\/Interface**\n\n* **(test) “Preferred Sources” in Top Stories**\n\nGoogle is currently experimenting with a new Search Labs feature called Preferred Sources, located in the Top Stories carousel. Users in the U.S. and India can opt in via Labs, then mark their favorite publications by tapping a star icon next to the Top Stories results. Once selected, the user’s starred sources will appear more prominently and frequently in their Top Stories feed.\n\n* **Google tests AI Mode button in Chrome’s search bar on desktop & Android**\n\nTests have shown a new “AI Mode” button appearing directly in the Chrome address bar, on both desktop and Android, for users in the U.S. and India. \n\n**Source:**\n\nGoogle The Keyword > Product > Search\n\nBarry Schwartz | Search Engine Roundtable\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**AIO\/AI Mode**\n\n* **AI Mode in Search Labs expands to India as part of global rollout**\n\nGoogle rolled out AI Mode in India as an experiment in Search Labs in English. Now users see a dedicated \"AI Mode\" tab in Google Search.\n\n**Source:**\n\nGoogle > Product Updates \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Tech SEO**\n\n* **Self-service hotel rates end on Google, partner integration now required**\n\nOn July 1, the option to manage hotel rates directly through self-service tools was discontinued. Properties must now work with an approved booking partner—like a reservation system or third-party integration—to appear in hotel listings.\n\nHotel rates that aren't managed by one of these partners will stop appearing in both search results and hotel ads. Google provided a list of certified partners to support this transition. The update also applies to free booking links. Hotel sites can still receive traffic at no cost if properly integrated.\n\n**Source:**\n\nBarry Schwartz | Search Engine Roundtable\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ \n\n**Local SEO**\n\n* **Google Business Profiles now display social profiles above posts**\n\nGoogle updated Business Profile layouts to feature social media links prominently above the Google Posts section. This change brings social verification to the forefront and helps businesses showcase their broader online presence.\n\n* **“Posting reviews is turned off for this place” notice in Business Profiles**\n\nSome users have reported seeing a new message—“Posting reviews is turned off for this place” on select Google Business Profiles. It bars them from leaving feedback or reviews. \n\nThis typically appears for organizations that are unverified or restricted in some way, possibly to reduce spam or low-quality reviews. \n\n* **Google disallows adding countries or states to service-area Business Profiles**\n\nGoogle updated its guidelines to prevent businesses from using entire countries or states as service-area entries on their Business Profiles. Previously, profiles could list large regions (e.g. spanning 19 countries), but the revised policy mandates service areas stay within a two‑hour driving radius of the business location.\n\n* **Offerwall now live in Business Profiles**\n\nThe new offerwall feature in Google Business Profiles showcases deals and promotions directly beneath business information. SEOs and local marketers should note this addition because it boosts visibility and conversions for businesses offering special promotions.\n\n* **Google Merchant Center product status change history report returns**\n\nMerchant Center has reinstated the Product Status Changes history report, a previously moved feature now visible by default within the “Products” section. The report logs past status updates to help merchants see their product data flow better.\n\n**Source:**\n\nSyed M. Amir Hassan | X\n\nYoann Ferrand | LinkedIn\n\nStefan Somborac | X\n\nGoogle Ads & Commerce Blog\n\nBen Fisher | X",
    "created_utc":1751630698.0,
    "subreddit":"DigitalMarketing",
    "num_comments":3,
    "score":12,
    "sentiment":0.9881
  },
  {
    "id":"1lqlwb0",
    "title":"Anyone optimizing landing pages with built-in AI analytics, does the data actually help improve conversions",
    "text":"Many modern landing page builders are touting built-in AI analytics as the key to effortless optimization and boosted conversions. The promise of intelligent insights without needing to integrate separate tools is really appealing. But I'm a bit skeptical about how actionable and reliable this \"AI data\" truly is.\n\nHas anyone here is actively using these built-in AI analytics features for their landing pages? Have you seen a tangible, measurable improvement in your conversion rates directly attributable to the insights provided by the AI? Thanks for any insights!\n",
    "created_utc":1751537552.0,
    "subreddit":"DigitalMarketing",
    "num_comments":3,
    "score":2,
    "sentiment":0.9683
  },
  {
    "id":"1ljp4cw",
    "title":"How to grow my newsletter?",
    "text":"Hey guys,\n\nI run a newsletter for the physical security industry...stuff like access control systems, CCTV, and intrusion detection. There's a bit of crossover with cyber\/infosec, but not a huge amount in my opinion.\n\nI started this because our industry doesn’t really have any good newsletters. I’ve been following the AI and webdev space for the past few years and subscribe to a few solid newsletters there, which gave me the push to start my own.\n\nSo far, I’ve picked up some readers through Reddit, word of mouth, and LinkedIn. After the first release, a startup offered me a surprisingly generous sponsorship deal, which I accepted. I honestly had no idea this could even be monetized when I started, so it caught me off guard.\n\nSince then, I’ve learned a bit about how newsletters make money...but I still have no clue how to grow my audience. I engage with my target readers on Reddit, and that’s been my main source of growth.\n\nSo yeah, that’s where I’m at. Any advice on how I can reach a wider audience would be super helpful. I know absolutely nothing about marketing and feel very lost.",
    "created_utc":1750804351.0,
    "subreddit":"DigitalMarketing",
    "num_comments":3,
    "score":1,
    "sentiment":0.9856
  },
  {
    "id":"1lg1gy0",
    "title":"SEO news: AI Mode rolls out in the U.S., set to join core Google Search experience, too much off-topic content can hurt site performance, Google lowers threshold for removal-based ranking penalties",
    "text":"Hi colleagues! Let’s wrap up the workweek by diving into the latest news. No need to drag it out, so here we go:\n\n**AIO\/AI Mode**\n\n* **AI Mode rolls out in the U.S., set to join core Google Search experience**\n\nAI Mode has officially rolled out in the U.S., now available even for users browsing incognito or without signing in—no need to opt in via Search Labs. A new ‘AI Mode’ tab now appears in the search bar. \n\nSundar Pichai confirmed that AI Mode will eventually merge into the main Google Search experience, moving from its current separate tab into core search pages and AI Overviews.\n\n* **Google launches audio AI Overviews in Search Labs test**\n\nAudio Overviews—AI-generated audio summaries for select U.S. queries—are now live in Search Labs.\n\nUsers can now tap the ‘Generate Audio Overview’ button within search results to hear an English-language summary powered by Gemini AI. The embedded audio file plays after processing and includes source citations.\n\n**Sources:**\n\nPatrick Stox | X \n\nMatt G. Southern | Search Engine Journal \n\nLex Fridman | YouTube\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Search \/ SEO**\n\n* **Too much off-topic content can hurt site performance**\n\nJohn Mueller addressed concerns about ranking drops and indexing oddities, noting that sites mixing completely unrelated content may face unintended consequences. He explained that having “a lot of totally unrelated content on the site” (e.g., targeting random, unrelated keywords) can confuse both search engines and users.\n\nMueller advised site owners to consider whether this off-topic content was intentional and to clean it up or separate distinct topics. A clear thematic focus helps search engines understand a site’s relevance and prevents ranking losses caused by mixed content.\n\n* **Google eases opposition to AI-powered page translation**\n\nA recent update reveals a shift in Google’s stance on automated translation: sites using AI to translate content are now more likely to benefit from regional traffic rather than be penalized. This change follows Google’s approval of Reddit’s own use of AI translation.\n\nAdditionally, Google has removed some translation-related penalties it enforced in the past, making it easier for publishers to reach new audiences through AI-generated multilingual content.\n\n**Source:**\n\nBarry Schwartz | Search Engine Roundtable\n\nJohn Mueller | bsky\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**SERP features \/ Interface**\n\n* **(test) Product tags appear in Google Local Photos carousel**\n\nRecently, Google started testing product tags within Local Photos carousels, overlaying tags on images in the ‘Explore photos’ unit. Brodie Clark noted that these tags are likely auto-generated using product-feed data and AI.\n\n**Source:**\n\nSERP Alert | X\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**GSC**\n\n* **Suggestions on separating conversational queries in GSC** \n\nAlthough Search Console has been collecting queries from AI-powered search features for a while now, Google still doesn’t offer any built-in filter to separate them. These longer, natural-language queries are mixed with standard keyword data.\n\nTo address this, some SEO professionals have started experimenting with their own detection methods and have shared a few useful patterns that may help identify AI-style queries. Suggestions include filtering queries by word count and by interrogative keywords such as *what, why, when, how, where, which, can, could, should, do, does, is, are, will, who, whom,* and *whose.*\n\nIt’s important to note that this approach is **not** an official solution from Google.\n\n**Source:**\n\nMetehan Yesilyurt | X\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Documentation**\n\n* **Google softens policy on removal-based ranking penalties**\n\nGoogle updated its ’Removal-Based Demotion Systems’ guidance, changing the wording from “high volume” to “significant volume” of removal requests—such as copyright take-downs or personal data removals—that can trigger ranking penalties. The emphasis now is on the relative impact of removal requests, not just the absolute number. \n\nAs John Mueller explained, *“It’s basically just clarifying that it’s not the absolute number but rather the significance.”*\n\n**Sources:**\n\nGoogle Search Central > Blog\n\nJohn Mueller | bsky\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Tech SEO**\n\n* **Google drops support for seven rare structured data types**\n\nGoogle is phasing out support for seven rarely used structured-data markups as part of its effort to “simplify the search results page.” These features don’t offer significant value and aren’t widely used, so their removal should make search results cleaner and more focused.\n\nNote that support for more popular markup types, such as the recently introduced loyalty pricing markup, remains intact.\n\n* **Loyalty and membership program markup now supported in search results**\n\nGoogle has introduced structured data support for loyalty and membership programs, allowing businesses to highlight special pricing in search results. This feature can now be implemented via Organization and Product schema markup, ensuring loyalty benefits appear directly in search snippets.\n\nBusinesses already using Merchant Center can continue defining loyalty offerings there, while others can add the markup directly on-site. Validation is available through Google’s Rich Results Test.\n\n**Source:**\n\nGoogle Search Central > Blog\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Tidbits**\n\n* **Apple Visual Intelligence joins iOS 26 with screen search and on-device AI tools**\n\nApple has unveiled its latest AI initiative—Apple Visual Intelligence—as part of the upcoming iOS 26 release. Users can now take a screenshot and tap ‘Ask’ or ‘Image Search’ to get relevant information from Google, third-party apps, or even ChatGPT—based on what’s on screen.\n\nThe update also expands Apple Intelligence language support and introduces a new foundation-models framework for developers to build AI-powered features that run entirely on-device—enhancing privacy and enabling offline use. \n\n* **Camera-powered Live Search comes to Google app**\n\nGoogle is testing a new feature called Live Search in its main Search app (previously Gemini-only). With this feature, users can point their phone cameras at something and start a conversation with the app, which responds in real time based on what it sees and hears.\n\nYou can ask follow-up questions while keeping the camera active, and results include a scrollable carousel of websites used to inform the answer.\n\n**Sources:**\n\nApple | YouTube\n\n9to5Google | website ",
    "created_utc":1750418356.0,
    "subreddit":"DigitalMarketing",
    "num_comments":3,
    "score":18,
    "sentiment":0.9985
  },
  {
    "id":"1lvs2fe",
    "title":"Struggled with Etsy shop SEO so I made a toolkit with 150 prompts — happy to share it",
    "text":"Hey everyone 👋\n\nI’ve been testing some lightweight AI tools and custom prompts to help clean up Etsy shop bios, product titles, and SEO descriptions for a small side project I’m running.\n\nHere’s what’s actually been working for me:\n\n\t1.\tPrompt: “Write a catchy Etsy product title under 140 characters using SEO keywords for [product].”\nI tweak and test it in Marmalead or eRank.\n\t2.\tPrompt: “Rewrite this product description to sound more professional, friendly, and trustworthy.”\nHelps reduce bounce rate and builds trust.\n\t3.\tPrompt: “Create a shop bio that sells my vibe and includes 2 keywords naturally.”\nSurprisingly helped me rank a little higher in Etsy search.\n\nI ended up building 150+ of these and packaged them as a cheat sheet for myself (and now others). Not trying to hard sell, but if anyone wants to check it out and give feedback, I’d appreciate it 🙏\n\nCurious what other SEO\/AI combos people here are trying? I’m always testing!\n",
    "created_utc":1752089754.0,
    "subreddit":"DigitalMarketing",
    "num_comments":3,
    "score":1,
    "sentiment":0.95
  }
]