[
  {
    "id":"1lwn1vl",
    "title":"Is AI actually going to ruin the job field and cause unemployment to go up?",
    "text":"I constantly see people talking about this. I \\*personally\\* think it's a fearmongering tactic that is really unhealthy to be pushing on the younger generation (which I am a part of).\n\nWhen you look at the industrial revolution, people were totally against the mass use of machinery because it was \"taking all the jobs\". They were also against a lot of some the other advancements at the time. Some jobs may have gone away because of this, but many more were created as a means to help continue advancing society.\n\nI really feel like this is the same thing that will happen with AI. Of course AI will replace some jobs, but will it seriously not create any? There are SO many things that AI simply can't do.\n\nThe first sentence is my opinion and I'm coming here to ask what everyone thinks and get some insight as to whether or not my opinion might be blind to reality. I'm not trying to attack the opinion of anyone who disagrees. Just want some thoughts.\n\n  \nEdit: I should add that I'm talking about in the years ahead of now. Let's go 10 years out. I understand it's taking jobs now, but unemployment went up during the industrial revolution. ",
    "created_utc":1752178742.0,
    "subreddit":"jobs",
    "num_comments":446,
    "score":121,
    "sentiment":-0.6499
  },
  {
    "id":"1m1tyxe",
    "title":"Well, now I don't want to.",
    "text":"Call me a luddite, but I'm not doing an AI screen just to finish an application.",
    "created_utc":1752713924.0,
    "subreddit":"jobs",
    "num_comments":123,
    "score":239,
    "sentiment":0.1126
  },
  {
    "id":"1lu7wxi",
    "title":"If you use Ai at work you are training it for your job and beyond",
    "text":"We all are basically helping our own exit. Sone developers may think they are immune, wait This thing don’t need anyone. Time is now to think.\nIt’s inevitable.",
    "created_utc":1751926913.0,
    "subreddit":"jobs",
    "num_comments":78,
    "score":59,
    "sentiment":0.5267
  },
  {
    "id":"1lu9q6l",
    "title":"Companies That Tried to Save Money With AI Are Now Spending a Fortune Hiring People to Fix Its Mistakes",
    "text":"[https:\/\/futurism.com\/companies-fixing-ai-replacement-mistakes?utm\\_term=Futurism%20\/\/%2007.07.25&utm\\_campaign=Futurism\\_Actives\\_Newsletter&utm\\_source=Sailthru&utm\\_medium=email](https:\/\/futurism.com\/companies-fixing-ai-replacement-mistakes?utm_term=Futurism%20\/\/%2007.07.25&utm_campaign=Futurism_Actives_Newsletter&utm_source=Sailthru&utm_medium=email)",
    "created_utc":1751931666.0,
    "subreddit":"jobs",
    "num_comments":63,
    "score":1017,
    "sentiment":0.264
  },
  {
    "id":"1lw87hy",
    "title":"Roast my resume, 250+ applications since April",
    "text":"Not much else to say. Please help me I can’t take this anymore.",
    "created_utc":1752139139.0,
    "subreddit":"jobs",
    "num_comments":60,
    "score":19,
    "sentiment":0.6124
  },
  {
    "id":"1lg9pqy",
    "title":"7 months. 1000+ apps. Endless rejections. One offer. I’m in.",
    "text":"Started my BA (Business Analyst) job search back in October while still in school. It was an on-and-off process until the end of May when I finally got an offer. In total, I applied to over 1,000 positions, got 19 interviews, and eventually accepted an offer from a Tier 3 consulting firm doing data-focused BA work.\n\nThe hardest part wasn’t my resume or skills — it was how draining the process was. Job boards, resume tweaks, endless applications… I was spending at least 2 hours a day just on repetitive tasks, and it really wore me down.\n\nHere are a few things that helped me stay on track:\n\n✅ Be intentional when searching\nInstead of randomly scrolling through jobs, I built a system. I split my search into two sets of keywords:\n\nSkills: SQL, Tableau, stakeholder communication\n\nIndustries: healthcare, public sector, non-profit\nThen I used these combos to reverse-search for roles that fit.\n\n✅ Structure your interview prep (don’t just memorize answers)\nFor behavioral interviews, I broke my past projects into STAR stories and reused a small set of well-prepared examples. It made interview prep much more manageable and authentic.\n\n✅ Automate the boring stuff\nLater in the process, I started using Correlate AI to auto-fill applications and get tailored job recs. It saved me a ton of time, especially for Workday listings (one-click apply!). I used that extra time to focus on interview prep and researching companies.\n\nOverall, BA roles tend to have longer hiring cycles and put more weight on soft skills and business context. My advice: start early — don’t wait until you’ve finished all the Leetcode to explore your direction.\n\nThe market is still very competitive, but with the right tools and a good pace, the whole process becomes a lot more sustainable.",
    "created_utc":1750440203.0,
    "subreddit":"jobs",
    "num_comments":31,
    "score":39,
    "sentiment":0.5773
  },
  {
    "id":"1ln4s5w",
    "title":"The Job Market isn’t it for Gen Z trying to gain experience and it will only get worse in the future",
    "text":"Honestly, job searching has been completely hell for me these past few months. Majority of jobs require experience and even some walk-ins attempts I tried, they tell you that you have to go apply online. For people getting started in the workplace like me, this makes getting started difficult. I have no work experience and than some positions view me as overqualified because of my current credentials (Already obtained a STEM related degree and now currently in college for a bachelors in marketing). I simply been searching for a job to make some money over the summer, but I am getting ghosted from everywhere and this includes fast food jobs or even cashier positions. Applying online has not been helpful especially with the systems requirements to say certain keywords to filter people out. Like it’s not even only that I am getting ghosted but I am not even getting a simple rejection, like absolutely NO RESPONSE. I am also dealing with ADHD, Anxiety and more mental health issues that I been maneuvering with and still willingly pushing through with in college thanks to the help of accommodations, and next semester I am enrolled to take 5 classes so working a job while taking 5 classes is way to much for me to juggle, even my family agreed that would be to much to do. So it’s not even like I am searching for permanent work. I feel the job market for people will only get worse in the future, and we already heard about the rise of AI doing certain jobs and how more companies are going to lean on AI for work due to convenience and saving money (even though in my personal opinion I do not feel AI can successfully replace every single job, but I will discuss that topic later on). But how exactly is Gen Z supposed to get into the workplace if they aren’t even being given the opportunity to build real world experience? I feel even the skills I have are being overlooked before I can even prove myself because I am not being given the opportunity to bring my talents to the table.\n\nIt’s actually crazy to me hearing my parents talk about getting a job being as simple as walking in and talking to someone to get hired when they were my age, and it’s like the older people in my family put pressure on me to just simple get a job which obviously isn’t as easy as whatever they where experiencing back than. I came to a point where honestly, I have job searching fatigue at this point and don’t have the energy to keep searching for jobs in such a small town with limited options. Even if suggested I get a job through school connections, my school is in NYC and I have to travel from upstate to NYC to stay in the dorms for the semesters. I can’t get a job through school connections for summer position or temporary work in upstate.\n\nIs any other college students going through this issue with job searching? Or does anyone have any advice on how to pull specifically temporary or summer positions? \n\nDo you think part of the issue could also be that I am in a small town currently? For anyone specifically who lives in NYC, is getting a job as challenging, or possibly less? Maybe I am aiming for work in the wrong location and that is playing a part in my struggle. ",
    "created_utc":1751167192.0,
    "subreddit":"jobs",
    "num_comments":24,
    "score":35,
    "sentiment":0.9434
  },
  {
    "id":"1lksecu",
    "title":"I gave a Salary expectation-Am I cooked",
    "text":"I applied for the job and got someone to hand over my resume for extra effect. It’s kind of corporate in a big company. They emailed me and asked for my salary expectations directly. I felt it would be unprofessional to deviate and kinda put the ball back in their court - maybe they would think I didn’t know my worth or do research on how much it pays. I do have good experience that goes with the description so I gave a pretty strong number based on research and experience…and thanks to AI, which also iterated that it might not be professional to not respond directly.\n\nIt’s been a few days and I have heard nothing back. Has anyone experienced something similar when it went well or badly? And if more a hiring manager, what are your thoughts on this? Also, this was before an actual interview for context.\n\nAny help would be appreciated.\n\nThanks.",
    "created_utc":1750917079.0,
    "subreddit":"jobs",
    "num_comments":20,
    "score":2,
    "sentiment":0.9668
  },
  {
    "id":"1lquowi",
    "title":"(English Degree) Resume or Job Search Suggestions",
    "text":"\nHey there! \n\nI've been stuck on a job search for over a year now, looking for a copywriting or related, fully remote position (I have to do remote since I don't have a working car or the means to get one, and public transportation is terrible near me). I typically use LinkedIn, Indeed, or the company website. I'm in the U.S., but have applied to jobs both in and out of the country if they're willing to hire.\n\nWith over 300 applications, I've gotten a whole two phone interviews. One went on for three rounds before getting ghosted. The other was nice enough to send a rejection email after the 1st round. I tried reaching out to both to ask if anything stood out or was lacking in my interview to hopefully get a better idea for my next interviews, but never heard back.\n\nGhost job listings are a real problem. I try to keep an eye out for new listings (instead of reposts) or using the company's website to ensure that they're hiring. I've gotten scam emails about jobs and when I call the company, they aren't even hiring. \n\nI know the job market is a competitive place, my experience isn't really the strongest, and AI seems to be taking over a lot of the copywriting roles. I'm definitely willing to branch out if I can land a job in a new path, but I fucked up choosing an English Degree as my options seem limited.\n\nDoes anything about my resume specifically stand out as not ideal? Is there something I can improve on? \n\nMy company doesn't give out growth statistics to employees, so I can't give specific numbers, which is why I use broader phrases like \"contributing to increases in revenue..\"\n\nI appreciate any help, thank you in advance!\n",
    "created_utc":1751561781.0,
    "subreddit":"jobs",
    "num_comments":18,
    "score":5,
    "sentiment":0.7863
  },
  {
    "id":"1luf8s7",
    "title":"Jobs these days",
    "text":"The same people expect us not to use AI for cover letter\n",
    "created_utc":1751947918.0,
    "subreddit":"jobs",
    "num_comments":12,
    "score":43,
    "sentiment":0.0
  },
  {
    "id":"1ligrl2",
    "title":"How many of you lost your job\/work because of AI? And what do you do now?",
    "text":"I remember that before you had to buy a bus ticket from a person, but then it was all replaced by a machine and now SMS. This is not AI.\n\nAnd when social media and Tinder appeared, I see the dating going upside-down: I had access to ladies that I never thought I would date. And the local ladies, either they didn't like me, or they were bland to me(which is not good thing). I liked to visit them, the teasing notivator to do such distance was for the trip. Otherwise, I would not commit to such distances...\n\nSo this is the technology which is replacing people or the humanity in the experiences. \n\nBut my question is not about all technology, but strictly, how many of you, or cases that you know in your company, that made people loose their job because of AI?\n\nThey speak a lot that AI replaced many and it is at the cause of some layoffs, but didn't see actual examples of them speaking their personal story to, understand fully the scale of the situation.\n\nSo I guess this is your chance to share of you... maybe someone you know, or from your work.\n\nI see the AI getting stronger with every quarter of the year. It saved me many hours and my graphica portfolio which I put time on, seems useless now.\n\nBut the negative effects, it seems it replaced the junior roles in tech (the repetitive tasks), reframing junior roles nowadays as 6-24months interships which don't ever cover the rent... \n\nWas thinking also if the tech jobs are really future-proof.",
    "created_utc":1750685757.0,
    "subreddit":"jobs",
    "num_comments":11,
    "score":1,
    "sentiment":-0.8336
  },
  {
    "id":"1lrxrjp",
    "title":"company has gone downhill and i want to quit ASAP without notice",
    "text":"after a few years at a small marketing agency, i feel both burned and burned out. (this is a long one, mostly a rant, but also asking advice)\n\ni was the first person hired to specialize in social media, which meant constantly having to prove my value and fight for boundaries and respect. i created SOPs to define my role and streamline processes for social deliverables, but coworkers regularly bypass them and do my job. Leadership acknowledged in the past that this has been an issue since \"before i got here\" but has yet to resolve it.\n\nthe agency has grown a lot in the past year - leadership has expanded but not improved. sadly one of our VPs passed this year, which I feel has caused the company to lose direction. toxic dynamics have gone unchecked especially a \"mean girl\" duo whose behavior drove out a new hire a few months ago. she got iced out bc she confided in her director that she didn't like mean girl #1's teaching and behavior (micromanage-y). that director straight up told the mean girl, thus causing the duo to give new girl the cold shoulder.\n\nleadership begged her to stay, then \"accepted\" her resignation a few days later. then the mean girl who'd trained her got promoted a few weeks later. **reward toxic behavior? check.**\n\nthat director recently leaked my concerns too when i asked my director to help enforce the SOP. the two of them spoke and then Loose Lips told the account team that i was feeling \"unappreciated\". (not what i had said). **management w\/ no people or management skills? check.**\n\na few weeks ago, 3 people were laid off. 2 of them were struggling but neither got the support they needed. both were going thru personal stuff and often criticized by the previously mentioned mean girls. the third had big shoes to fill when she was hired last fall and was unfairly compared to her predecessor. leadership said it was \"slow business\"... **layoffs w\/ no clear explanation? check.**\n\nsince then, things have gotten worse. some coworkers are openly disregarding my role again — even seeming to celebrate the layoff of our copywriter so they could do copy themselves. meanwhile, i've pushed for months for us to address AI use, especially since clients are using it poorly and it’s affecting our work. only now is leadership finally discussing a policy. and we always say we're cutting edge and the leading agency in the state.\n\nlast week, they gathered everyone to start planning for the agency's 30th anniversary later this year. leadership was tossing around messaging ideas from \"our clients love us so much\" to \"i love my job here at XYZ agency.\" **tone deaf? check.**\n\ni don't feel seen anymore or valued, and i'm doing the bare minimum to get through each day. too much has happened i can no longer convince myself i can last until it gets better. my current director and the one that stepped up after our VP passed have been really supportive but i fear it's not enough . they're the only ones i worry about when it comes to who i'll impact when i leave.\n\ni'm currently job hunting, ideally out of agency life and away from social media. i'm emotionally checked out and tempted to quit the second i get an offer, but i'm a bit conflicted... i don't want to burn bridges especially when the marketing world is small here, everyone knows everyone. i might come back to the industry eventually.\n\nstill, i'm not sure i can deal w\/ 2 more weeks of tension and probably some cold shoulders. i know i'd be making a statement wanting to leave right after the layoffs. but a petty part of me wants them to scramble when i do leave.\n\nplus, my other digital teammate is my backup and she's also considering leaving now that she had to absorb one of the laid off jobs w\/ no comp. if we both leave, it'd create a major gap. is it bad i almost want that? lol\n\nidk, maybe it's not as big a decision as i feel it is but i'm a recovering people pleaser and overthinker LOL. am i not crazy in wanting to dip ASAP even if i lose any chance of rehire or being \"blacklisted\" in some way? what would you guys do - secure a new job and quit immediately? give 2 weeks, maybe just 1?",
    "created_utc":1751676359.0,
    "subreddit":"jobs",
    "num_comments":10,
    "score":10,
    "sentiment":0.9165
  },
  {
    "id":"1m0j7lc",
    "title":"How do you get over not having a job in your field of study?",
    "text":"I sunk four years of my life and about 25-30k getting the degree and haven't earnt a penny out of it. My main issue was timing as I finished college with a software degree two months into the pandemic of 2020 and had a graduate offer that was rescinded two weeks before the start date, all because of covid. My life has stalled ever since as I had to move back home and the consecutive years have been a blur as it does not feel anywhere near 5 years, even saying 2 years doesn't feel right to me. Current job market is bad and is getting exponentially worse over time isn't helping either and I get quite existential about my future especially because of the AI bubble.\n\nNowadays, I run a farm in exchange for having my rent and bills paid although I don't earn a wage and am downright unemployed. My current situation works out better than a minimum wage job, but the fact I have no pension contributions and such really bothers me. Don't even have a reference or proof of doing farm work during this time either. Parents could, but they won't in case of tax implications (their words) and a reference from a family member is assumably worthless.\n\nThe industry my qualification is in is still dreadful and having no relevant work experience since graduating is making me unhireable to be honest. I have worked on software projects throughout the years which interviewers have showed interest in and have continued studying even though it feels like I'm just wasting more time to the void by doing this. Made it to the final round numerous times, but its all pointless how far you get unless you receive an offer.\n\nI should be fairly deep into a prosperous career by now, but I am in the same position as I was before I started college, if not worse as I'm not that young anymore. Every morning I wake up with a pit in my stomach seeing what my life has become. It's very discouraging knowing that everyone else I know has a job in the field they studied, but of course I don't. The logical choice would be to move away from software but in reality, there's nothing else I want to do as I had my mind set on it as a career and still do to this day.",
    "created_utc":1752589636.0,
    "subreddit":"jobs",
    "num_comments":9,
    "score":5,
    "sentiment":-0.7978
  },
  {
    "id":"1ljfstp",
    "title":"Has anyone ever gotten a job with an AI generated cover letter?",
    "text":"I suck at writing cover letters, so I've been using ChatGPT to generate my cover letters. I give it my resume, the job description, & a sample of my writing to help it match my natural tone & voice. That last step makes AI detectors detect it as 82-98% AI, whereas if i omit that step, it gets flagged as 100% AI. I do tweak a couple words but not much editing besides that. \n\nI know people say to just reword it or whatever but idk how. Like the cover letters ChatGPT has written for me actually sound really good. i see influencers like Emily Durham & Erin Goff promoting chatgpt generated resumes & saying they sound great. However, I'm worried a hiring manager will either use AI detection software or be able to tell it's ChatGPT, & i wont get an interview. ive seen so many hiring managers on reddit & linkedin say an ai generated cover letter is automatic rejection. which isnt fair imo, its so hard for me to write a cover letter because i have an extremely negative self image & see myself as having no good qualities. when i try to write i cover letter i overthink so much. \n\nI also admittedly struggle with articulating why I want a job, or what draws me to that company, etc. I'm 20, I don't really know what i want to do with my life, i just need something that pays. ",
    "created_utc":1750782685.0,
    "subreddit":"jobs",
    "num_comments":9,
    "score":0,
    "sentiment":-0.2963
  },
  {
    "id":"1lxtauq",
    "title":"AI for automatic job application",
    "text":"Can anyone give any suggestions which AI software (paid and free) should be used for automatic job applications? \n\nReally manual application is getting tough as I am being late to submit my app right after job posting. Need to be fast to apply from now on. \n\nHelp please. Urgently need a job.",
    "created_utc":1752300637.0,
    "subreddit":"jobs",
    "num_comments":9,
    "score":0,
    "sentiment":0.7783
  },
  {
    "id":"1m3yx6s",
    "title":"First real analyst interview ever. Panicking. Anyone down to do a mock or give tips?",
    "text":"Hi guys,\n\nSo backstory, I’m 30 years old and recently graduated late last year with a bachelor’s in data analytics. Since graduating, I’ve been trying to break into the field with no luck. I’ve applied to over 160 jobs just in the past month and only landed 3 phone screens, none of which moved forward.\n\nRecently, my wife saw a job posting at her company that matched my field and forwarded my resume to the manager of that position. She doesn’t know them personally or anything, just figured it was worth a shot. Somehow, that actually led to a phone screen, and now I’ve got a “behavioral and job-specific” interview in just a few days.\n\nI looked up the job, and despite the listing saying there were \"100+\" applicants, I somehow got through the phone screen and scheduled for the interview all in the span of a single day. Sadly, this interview is the closest I’ve ever been to starting a real data career, and I’m both excited and freaking out. I’ve only had two interviews in my life, and both were for warehouse grunt floor job so this is a whole new level.\n\nEver since I got the interview, I’ve been in full panic study mode. I’ve been spending about 9 hours a day reviewing SQL, Excel, and Power BI, and re-reading the job description like it’s an exam study guide. I’ve been watching YouTube videos on analyst interviews, doing mock interviews with AI, and even trying to cram a bit during work hours at my current job just to get some extra reps in.\n\nUnfortunately, I’m an absolute mess during interviews. I sound like some mix between Donald Trump without the confidence and a sleepy old man trying to tell a long story. I \"um… uh…” like crazy and sometimes I’ll say the same thing three different times in three different ways in case the first two didn’t sound nervous enough.\n\nI’ve also been battling some heavy low confidence & imposter syndrome. My current job doesn’t relate to my degree at all, and I just had a baby in the past year, so I’ve been stretched thin. And when I see “100+ applicants” on the job posting, I just assume everyone else has a master’s, a polished portfolio, and actual analyst experience. The most I been doing at my job is visualizations but it's not like that's finding insights or anything. To add salt to the wound I'm already located in the Silicon Valley so that just about gives you an idea of the people I'm trying to compete against. I feel like I'm completely cooked.\n\nHonestly, I already feel embarrassed that the dashboard I listed on my resume was just a solo school project. Not even a capstone, just a basic class assignment. It’s all I’ve got, and I’m pretty sure it screams rookie.\n\nI really want this job, not just for the title or the role, but because it would be lifechanging. I’ve spent most of my adult life making garbage pay and quietly battling depression, wondering if I’d ever get out of it. Going back to school was a huge risk, and this would be the first sign that it wasn’t all for nothing. The job pays around $69K, and while I know that’s low for a lot of people here, but it would completely change my and my family’s life. I know some of you make $120K+ and beyond, but for me, this is my shot at actual stability and finally getting into the field.\n\nIf anyone has tips for behavioral or technical interviews (especially for analyst roles), what kinds of questions to expect, or would even be willing to mock interview me, it’d mean the world.\n\nThank you. I’m doing my best, but nerves are absolutely winning right now. I’m trying to expect the worst but hope for the best. I know putting all my eggs in one basket for a single interview is a terrible idea and probably even worse for my nerves, but it’s hard not to. It’s hard to believe this ISN'T my one shot, because it really is.\n\ntldr; late grad trying to break into data analytics after 160+ rejections. Got a surprise interview thanks to wife. I’ve been cramming like crazy but struggling with nerves, imposter syndrome, and interview anxiety. This job would be life-changing for me and my family. Would love any advice or mock interview help.",
    "created_utc":1752938733.0,
    "subreddit":"jobs",
    "num_comments":8,
    "score":1,
    "sentiment":-0.2181
  },
  {
    "id":"1lseqeo",
    "title":"Is This Miami Job Posting Legal? Google & PwC Citizenship Restriction Concerns",
    "text":"Hey everyone, I came across this job posting on LinkedIn for an AI Full Stack Engineer - Manager role at Google, located in Miami, but it specifies that only Mexican citizens will be considered, referencing Article 7 of the Federal Labor Law. Over the past month, I’ve noticed this is the 9th or 10th similar posting from Google with these unusual citizenship restrictions. Is this even permissible for a U.S. job, given EEOC rules on national origin discrimination? Maybe it’s linked to a cross-border project or outsourcing? The salary range is $99K-$322K\/yr, but the restriction seems questionable. \n\nCheck the image below for more details.\n\nAny thoughts or experiences with this? Should I flag it or just move on?  \n\n*Not a lawyer, so looking for insights!*\n\nhttps:\/\/preview.redd.it\/zq6l6kfo73bf1.png?width=1522&format=png&auto=webp&s=355742e99c707dc7e39980aad90df97287acc067\n\n  \n\n\n\n\n",
    "created_utc":1751735241.0,
    "subreddit":"jobs",
    "num_comments":8,
    "score":0,
    "sentiment":-0.7907
  },
  {
    "id":"1lvnlum",
    "title":"Do any of the AI job search tools actually work?",
    "text":"I see ads for them all the time, but of course they require payment - any who, being out of work, has disposable income to throw around if the sites are actually BS? It’s just been less than 3 months for me now, just starting to really dig my heels\nInto the job hunt, (had severance and have unemployment until end of October) but hitting dead ends. It doesn’t help that I’m 59 - one great lead went to shit the second the interviewer saw me - I’m MORE than qualified for the position and the recruiter said I was perfect, but I could see it immediately in the VPs face over zoom - it shouted TOO OLD and of course, crickets since. Not even the decency to tell me no dice.\n\nSo — an average of 10 apps a day and nothing. Advise on hacks or apps? Thanks. ",
    "created_utc":1752079364.0,
    "subreddit":"jobs",
    "num_comments":8,
    "score":0,
    "sentiment":0.2824
  },
  {
    "id":"1m1pq6e",
    "title":"the job search mistakes that made me HATE the job market",
    "text":"nobody tells you how demoralizing job hunting actually is until you’re in the middle of it.  \nsending out hundreds of applications, rewriting your resume 50 different ways, refreshing your inbox like it’s a slot machine. it messes with your head.\n\nhere’s the stuff i learned the hard way, so maybe you don’t have to:\n\n**if you’re applying to everything, you’re applying to nothing**  \nwhen i started, i applied to every job that even *kinda* fit me. “growth marketer? sure.” “product intern? why not.” “customer success? close enough.”  \nit made me feel productive but honestly just wasted my time. half the jobs i landed interviews for, i didn’t even want.  \nnow i apply to fewer roles but actually tailor the application to what i care about. weirdly, i started getting more interviews that way.\n\n**applications don’t get you hired. conversations do**   \ni used to think if i just clicked “apply” enough times, something would stick. but the jobs i got real traction on? they started with a dm or email. sometimes just a “hey, applied for the \\[role\\], would love to learn more about the team.”  \ni got tired of spending 6 hours a day doing cold outreach manually, so i started using some ai tools to help me automate some of the recruiter emails and follow ups. Some worked, some didnt, but at the end it saved me so much time i don’t know why i didn’t do it earlier.\n\n**your resume isn’t a biography, it’s a billboard**  \nrecruiters are skimming. they’re not reading. if you don’t hook them in the first 7 seconds, they move on.  \nevery bullet point should answer one question: why does this help me do this job  \nuse action > result > proof. no fluff.\n\n**track your process or you’ll spiral**  \ni used to apply and forget where i applied. then get stressed because i “wasn’t doing enough.”  \nturns out i *was* doing enough, i just wasn’t tracking it.  \ni started logging every app in a google sheet:  \ncompany  \njob title  \ndate applied  \ndid i follow up?  \ndid i hear back?  \nthis sounds basic but it kept me from losing my mind. it also helped me see when things were actually moving forward (even when it felt like nothing was happening). Also this takes some time, so dont be inpatient.\n\n**interviewing is a skill you have to practice**  \ni bombed my first 3 interviews because i thought they’d just “get me” if i was myself.  \nnah. interviewing is like a mini performance. you have to practice your answers out loud, even if it feels weird.  \ni literally recorded myself answering “tell me about yourself” 10 times until it didn’t suck anymore.\n\n**burnout will sneak up on you if you don’t pace yourself**  \nthere were days i applied to 15+ jobs. by the end of the week i hated my laptop, my career, and myself.  \nnow i do 3 to 5 solid apps a day max. quality over quantity. then i log off and go outside. but then again, it depends on which job sector you are in.\n\n**last thing: nobody has this figured out**  \nthe people hiring you? stressed. the recruiter? overworked. your friends who “got lucky”? they probably felt just as lost before they landed something.  \nyou’re not failing. you’re just stuck in the messy middle like everyone else.\n\nkeep going. you’re closer than you think.",
    "created_utc":1752702753.0,
    "subreddit":"jobs",
    "num_comments":8,
    "score":50,
    "sentiment":0.6471
  },
  {
    "id":"1luajyj",
    "title":"Finally Got a Job - But Here's The Thing...",
    "text":"Hello r\/jobs community, I'm Silis, an ex-software developer. I got fired from my full stack job in March 2025 (not performance related).\n\nI had been looking for a job for a while and after hundreds of applications, I somehow got hooked up with a staffing agency called Manpower. The lady who helped me was kinda... attractive ngl. Like the way she laughed on the phone was so cute bro (this is besides the point).\n\nAnyways, the staffing agent lady pretty much alley-oop'd me a position at Fedex for a data entry role. The whole process was pretty much like this:\n\n1. Staffing lady calls me on the phone\n2. Email back and forth\n3. Take-home data entry assessment (very easy, most of u guys could pass)\n4. I pass the assessment (obviously it was so easy)\n5. She sends me a direct referral link for Fedex (i think thats what it was)\n6. I fill out a bunch of forms\n7. Offer letter emailed to me, this is so simple...\n\nSomething I didn't mention is that a lot of companies are starting to adopt AI. One of the websites they used is something called Paradox AI and you'll notice a common name (Olivia).\n\nFedex had pretty much nothing to do with the hiring process. It was basically the cute staffing agent lady from Manpower and Olivia (a robot) from Paradox AI.\n\nHere's the thing tho... The pay range was $16.50\/hr - $23.00\/hr.\n\nSince the entire process had nothing to do with Fedex itself, I couldn't even negotiate the pay.\n\nWhat should I do guys? I can't take $16.50\/hr bro. My developer job was about 2x that salary...",
    "created_utc":1751933958.0,
    "subreddit":"jobs",
    "num_comments":7,
    "score":1,
    "sentiment":0.9911
  },
  {
    "id":"1lzulfm",
    "title":"I am shocked by the hipocrisy of tech firms",
    "text":"So, recently I have been reading a lot of news and articles regarding the layoffs in tech. The thing which I found common in most of them is that they particularly mention about the importance of AI and how it is now must for every employee to command on using AI tools. \n\nBut when it comes to the rigorous hiring process which a candidate has to go through to land the job, they don't want the candidate to take help of AI. Yeah to some extent I get it, that blindly using AI without having any fundamental knowledge is certainly not acceptable but why won't they allow candidates to use AI to maximize their performance, it would clearly demonstrate both their ability to use AI and their technical skills. \n\nWhat's your thoughts on this??",
    "created_utc":1752518285.0,
    "subreddit":"jobs",
    "num_comments":7,
    "score":14,
    "sentiment":0.8746
  },
  {
    "id":"1lzwk4b",
    "title":"I think my CV is a red flag- PLEASE help me…",
    "text":"I’m a recent grad who’s been working since 18, being lucky enough to get 4 years of experience in marketing and content strategy\/ copywriting. I think the mixed nature of my experience across freelance, part-time time and full-time, as well as overlapping roles (due to freelancing) is a red flag. I have no problem getting interviews- however, I do feel I should be getting more than I am. It just seems that when I reach the final stage interviews they start questioning and nitpicking my experience and how it all worked alongside uni and the overlapping timelines- they even seem confused. \n\nThe truth is, I had to fund my way through university as I have no parents or familial support. Instead of working in a part-time hospitality or retail job as many of my friends did I decided to get my foot in the door and get myself some corporate experience. This looked like freelancing and working part-time across term times and then full-time work over the course of the 6-month-long summers and a gap year that I took. This was also made largely possible by the fact that my roles were all remote. \n\nI managed to build experience and get promoted across two roles (one part-time and one freelance but on retainer to an agency) quickly, partly due to my desperation to succeed and also due to the fact that these were smaller companies (think 5-15 employees) with flatter hierarchy structures. I think this also looks like a red flag without context- or from at least how a recent interviewer acted (refused to believe I had the level of roles I had). \n\nI even had an interviewer question how I was able to complete a degree at a top 20 globally ranked university whilst working so much. It made me feel quite frustrated, to be honest and like valuable interview time was being wasted on questions about my work ethic and the juggling act that was uni. \n\nHonestly, I’m not sure what to do next. I’m feeling really stuck. \n\nPlease tear my CV apart and let me know exactly what’s going on, whether it’s ATS-friendly and if I’m correct in thinking HR or interviewers are thinking it looks suspicious for a recent grad. ",
    "created_utc":1752522608.0,
    "subreddit":"jobs",
    "num_comments":7,
    "score":0,
    "sentiment":0.9577
  },
  {
    "id":"1lvbqmz",
    "title":"26,000 Applicants. 50 Openings. What we learned using AI tools to screen resumes",
    "text":"I recently worked with a mid-sized company that ran a big hiring round for \\~50 roles — mostly sales, operations, and entry-level tech. We had **over 26,000 applications** in 3 weeks. 😳\n\nTo handle the volume, we used a platform called [**HireMore.ai**](http:\/\/HireMore.ai), which helped us **screen and shortlist candidates using AI** before human recruiters got involved. It saved us time — but also revealed how much candidates *don’t realize* about how these systems work.\n\nI wanted to share what we learned — and how job seekers can **make their resumes stand out** in this new reality.\n\n  \nWhat went wrong for many applicants:\n\n* **Over-designed resumes**: Columns, tables, and fancy templates often broke parsing.\n* **Missing keywords**: Great experience, but written in the wrong language. (e.g., “client outreach” instead of “B2B lead generation”)\n* **Buried info**: Key details like location or certifications hidden in cover letters or deep in the resume.\n* **No tailoring**: Generic resumes sent to every job — easily outscored by candidates who aligned better with the JD.\n\n# What helped candidates stand out:\n\n* **Clear, clean formatting** — ideally one column, standard fonts.\n* **Skills section that mirrored the job post** — especially for tools or platforms (e.g., HubSpot, SQL, Figma).\n* **Specific, measurable achievements** (“Reduced churn by 15%” > “Handled customer queries”).\n* **Explicit info up front** — location, notice period, language fluency, etc.\n\n",
    "created_utc":1752042642.0,
    "subreddit":"jobs",
    "num_comments":7,
    "score":0,
    "sentiment":0.9468
  },
  {
    "id":"1lzux3e",
    "title":"Feedback requested. I've had a couple of people in my family lose their job (two in one household) and it got me thinking. They are desperate and unsure how they are going to pay their next rent without resorting to moving back in with mum and dad. I'd love to know what other think.",
    "text":"Sorry for the long read but I would appreciate your feedback. I'm semi retired now and want to try and help. I'm really glad I'm not job hunting right now.\n\nRecently a couple of people that are really close to me have lost their jobs. They are really struggling to get back into the workforce. \n\nWhile I was trying to help them, I did some searching on Reddit for ideas and noticed heaps (and heaps) of people are losing their jobs right now. In the news they say a lot of it is because of AI and cutbacks etc. I'm also seeing a lot of people are leaving school and unable to get their first job (no experience and no roles available)\n\nAnyway, my son in law is in his late 40's and is overqualified for most jobs or doesn't even get an interview because there are so many applicants. He's getting quite desperate. He's had to dumb down his CV from director of sales to sales manager to even get interviews. It's quite rough out there, and everything I read indicates it's going to get worse.\n\nIn my past life, I used to write online courses for a living (think corporate training, onboarding stuff, skill-building, stuff). I've also been quite successful in a couple of businesses.\n\nSo I’ve been toying with the idea of using my course-building brain to build something that might be able to help people. I think I can get some local government support or sponsorship so I can make it free. (I'm not trying to sell you anything. I haven’t even set up a website)\n\nThe format I've been thinking about:\n\n\\- A short newsletter every few days with practical tips, ideas, and help (not preachy)\n\n\\- Maybe I could make some mini bite-sized courses as I go (things you can actually use, not influencer BS)\n\nAnyway, I'm super open to feedback on what would be most helpful. I just want to build something that can help people.\n\nI've had a few ideas on what would be most useful.\n\n1. Financial First-Aid: how to stop financial bleeding after a job loss. Stuff like how to cut costs, negotiate bills\/mortgage etc, and build a micro-budget to survive.\n\n2. Job Search: how to stand out when 500 people apply. I'm thinking refocusing resume for an AI world, how to network, and scripts you can use. Also, things to get past the ATS black hole.\n\n3. Micro-Income ideas in the Meantime: stuff you can do this week to make a little money. I'm not talking 7-figure business startup BS. Just some practical things that might add up and help you get by.\n\n4. Solo Skills: maybe you can take something you already know and package it into a service for local gigs, tutoring, consulting, etc.\n\n5. AI Basics: not another guru course. Just enough to help you improve a CV, tweak a cover letter, or prep for interviews with AI help without getting flagged by those resume scanners. Also, enough to ensure that you come across as AI proficient for your next role. (Applying it in a real job environment)\n\n6. (Maybe) : something more reflective that helps you figure out what’s next when you can't get a job. Just to keep the momentum and mindset right.\n\n7. And for the sales people (like my son in law): how to do fractional work (That's where you do doing 2–3 part-time roles instead of just one full-time job) In sales, it might mean that you are not on the payroll, but get paid based on performance by multiple companies at once (how to pitch it so it's no risk and no brainer for a company to take you on)\n\nSo before I jump in too deep without thinking, I wanted to know if other thought it might be worthwhile, and what would be most helpful right now. (I'm sitting on my hands, have the time, and I have contacts that can probably fund this for me)\n\nWould this help you? What would you actually want in something like this? Are there topics I’m missing?\n\nI really want to help people. Happy to chat in the comments or DM. No sales pitch coming after this. Just trying to do something to help people.\n\nThanks\n\nPS: I numbered the ideas I came up with so you can just comment with numbers (eg 1,6) if its easier. If you have better ideas I would love to know. (And if you have ideas for my son in law, that would be amazing too)",
    "created_utc":1752518995.0,
    "subreddit":"jobs",
    "num_comments":6,
    "score":1,
    "sentiment":0.9985
  },
  {
    "id":"1lmhmjj",
    "title":"Applied to 300 positions in 2 months; Not a single response",
    "text":"I'm at a loss. I have 3 different resumes for different types of fields I have experience in, all have been ran through AI filters and are passable. My LinkedIn has been updated, social media has been cleansed, and I have no idea what to do. I live in a small town, so that doesn't help. My only stipulation for employment is that it has to be temperature-controlled. My experience includes - event planning, bartending, restaurant management, auditing, front desk, program coordinator, CNA, and patient care. I've applied to everything from hotels to hospitals to dishwasher to cleaning services. I'm really at a loss here, my current job is trying to hire out from under me and my applications aren't even being viewed!\n\nI've applied on Indeed, LinkedIn, job boards, through the company websites themselves. To follow up, I will call, email, and I've tried going in to talk to someone - they tell me to apply online. I'm on every list for temp agencies, but they are only hiring for factory and there are NO temp-controlled facilities in the area. I've posted on local business pages, networked as much as possible, I really don't know what to do. My applications won't even be viewed, if they are, it takes months for them to see it just to send me a denial letter.  \n\nAny advice at all would be amazing, I feel like I'm going crazy.",
    "created_utc":1751098463.0,
    "subreddit":"jobs",
    "num_comments":6,
    "score":8,
    "sentiment":-0.1366
  },
  {
    "id":"1lzeurg",
    "title":"The lower the bureaucratic barrier, the worse the candidates",
    "text":"LinkedIn designed their user flow to let a candidate apply for a job with a single button click. From a platform design standpoint it makes sense, everyone has all the information they need there, it doesn't need to be more complicated.\n\nHowever, anecdotally, my partner recently posted a suite of C level openings and specialist roles, and LinkedIn caps it out at 40ish candidates per post before telling her to pay to receive more candidates.\n\nThis alone sucks but now there's also a huge conflict of interest with LinkedIn. They make more money by boosting the number of applicants irrespective of quality and fit, and whether or not the posting fills or not.\nSo she's getting around 10 out of 40 applicants being bots or with totally irrelevant experiences or totally irrelevant backgrounds.\n\nThere's always a couple applying with no intention of relocating, others missing language requirements, many programmers for non programming roles, many from blacklisted countries, many with trash resumes that are mindblowingly bad like not listing any jobs but have 10 years of experience, or 25+ certificates from unaccredited sources, or very clear AI slop for content on their profiles and resumes, or very clear identity theft\/impersonation but with many lazy af mistakes. These were all no-go criteria stated in the job description - these candidates didn't read.\n\nI'm mad at the state of things but employers are also struggling. It's a legit shit show with how much time is wasted because of how low the quality of candidates are. \n\nWhatever quality candidate you are, you're already amazing because you aren't \"spam\" candidates. Only issue is how to filter and discard the trash.\nSome of these spam applications are \"programmically smart\" like they're designed to fool AI recruitment tools but they're shit at passing human eyes, but even then they're a huge waste or everyone's time. One thing is these applications will write \"GPA 4.0\" or something garbage in white on white so it may help them bypass some tools but it will still get thrown out at the next stage. \n\nUnfortunately my partner's organization doesn't use these screening tools so they're really struggling under all the trash.\n\nI guess what I'm saying is recruitment and job seeking is a two way street. It actually does suck for everyone involved, employers too. Don't try to game the system, everyone looses when that happens.\n\nShe has tried to make it easy on candidates to apply but the result just isn't there. Is LinkedIn purposefully boosting applicant numbers say by running bots on their own platform? We may never know.\n\nShe's now adding arbitrary bureaucracy to weed out at least those that can't read and follow instructions, like to also email the resume as well as apply on LinkedIn. \n\nI've checked, her job descriptions are not unreasonable. \n\nThe process sucks but imo no one is out to ruin your life. Try to go into interviews and stuff with some positivity of helping each other find a match. Imo people can feel negativity, like if I didn't sleep well people can tell I'm tired and irritable. Empathize, help each other out and make this win win.",
    "created_utc":1752473304.0,
    "subreddit":"jobs",
    "num_comments":6,
    "score":1,
    "sentiment":-0.8161
  },
  {
    "id":"1liymu1",
    "title":"Current Job Market (Masters Degree)",
    "text":"Hello all at the moment I have put in about 300 - 400 applications for jobs within my field. I have a masters degree in history and a bachelors in liberal arts. Currently I’m a teacher and I hate it. I have applied to jobs that have some tailored descriptions which I can do such as research, analysis, project management, public policy and etc… \n\nI haven’t been able to receive any interviews or anything just denial emails. I do tailor the resume to the AI keywords at times because I know that majority of HR in companies use AI. I’m really doing everything in my will to land another job even calling at times. Some tips or advice are helpful! ",
    "created_utc":1750729219.0,
    "subreddit":"jobs",
    "num_comments":5,
    "score":8,
    "sentiment":-0.2942
  },
  {
    "id":"1lpnako",
    "title":"Looking for feedback: Al Resume Builder that helps you pass ATS filters and get interviews",
    "text":"Hi everyone,\n\nI'm currently building an Al-powered resume builder that helps job seekers optimize their resumes for ATS (Applicant Tracking Systems), increase their chances of getting noticed, and ultimately land more interviews.\n\nThe tool will offer:\n\nAI create resume with basic details \n\nReal-time ATS compatibility score\n\nKeyword optimization suggestions\n\nAl-generated bullet points tailored to job descriptions\n\nOne-click formatting and export options\n\nWould this be useful to you? Have you ever had issues where your resume didn't make it past ATS?\n\nWould love to hear your thoughts or answer any questions.",
    "created_utc":1751432418.0,
    "subreddit":"jobs",
    "num_comments":2,
    "score":2,
    "sentiment":0.9708
  },
  {
    "id":"1lvuwh8",
    "title":"Job Boards Can Go To Heck",
    "text":"Like most of you I am literally pulling my hair out applying on these damn job boards and entering the same information over and over again.  While our jobs are rapidly being outsourced by AI, these \"AI\" boards SUCK.  [Sonara.AI](http:\/\/Sonara.AI) (don't sue it!) used to automatically apply for matches, theoretically letting you apply for hundreds of jobs while you slept.  Also, it would automatically complete full applications and allow you to sort jobs by date.  The sort by date feature is now gone so I'm starting at job postings that are 60 days old with thousands of applicants.  The \"auto apply\" feature is also gone - it doesn't even complete repetitive fields for you.  Is there ANY job board out there with a true TRUSTWORTHY auto-apply function?   I m exhausted from typing in my exact same details 100 times a day - oh and btw these are generally drop-down questions so I can't even cut and paste.  Help!  I am going insane.",
    "created_utc":1752096492.0,
    "subreddit":"jobs",
    "num_comments":5,
    "score":0,
    "sentiment":0.7039
  },
  {
    "id":"1m1mp5q",
    "title":"Has AI impacted your day-to-day job yet?",
    "text":"With all the hype, i'm curious to know how other companies have started implementing it.  \n  \n\\- Has AI changed your work routine?  \n\\- Is your company helping you learn? learning on your own? ignoring it for now?",
    "created_utc":1752695591.0,
    "subreddit":"jobs",
    "num_comments":4,
    "score":1,
    "sentiment":0.4137
  },
  {
    "id":"1lmxsu9",
    "title":"Help. I’m feeling frustrated",
    "text":"I need some help with writing my resume. I’ve been out of work because I had to file for social security disability. During that process, I’ve actually learned a lot and went back to college. Still in college. I have a ton of skills I can’t forget. Ive redone my resume from my experience pov to AI generated and even copied the job descriptions and asked AI to form my resume according to the key words. Ive also been the first to apply to something when it is actually posted. I’m frustrated by this unnecessary nonsense. I need to write it so it will overlook my 3-year gap of being unemployed. I’m a healthcare administration worker. I’m pursuing a BHA and an MHA. Yes I am committed to finishing it as my strict deadline is December for my BHA and August 2026 for my MHA \n",
    "created_utc":1751145910.0,
    "subreddit":"jobs",
    "num_comments":3,
    "score":6,
    "sentiment":0.1779
  },
  {
    "id":"1lop7h2",
    "title":"Anyone else having issues getting proposal writing\/technical writing\/business writing jobs?",
    "text":"Hey, sorry y’all, new to this sub and not sure if this where I should be posting but:\n\nI lost my job in March. I’ve been job hunting ever since then but I’ve been a Technical Writer\/Proposal Writer for the past eight years (I have a B.A. in English and a Shipley certification too for further background) and I did some business writing contract gigs for the experience when I got out of college.\n\nAnyway, I’m posting because I’ve sent out probably close to 300+ applications\/resumes now and barely anyone is calling me. I’ve had a handful of interviews and even some second interviews but it always ends with, “the role has been canceled”, or “the role is being reworked”, or “we thought we needed this role but after further reassessment, we’re moving to a 1099 but thank you for applying”, or “we’re still interviewing candidates and reviewing applications, we’ll follow up with you soon.” \n\nAnyway, you get it. So I hardly have anyone calling me for an interview and then when I do get an interview, it all just fizzles out. I even asked a recruiter once if they had any feedback for me concerning my interview and if they think the interview went well and they literally told me, “you interviewed very well, we’re really just reworking the role” and so I’m at a major loss.\n\nIs it me? Is it the job market right now? Is it my niche career field? Because I was applying to another job online yesterday and I saw this message: “…. employee who was impacted by the recent reduction is government funding… “. \n\nDo my interviews keep fizzling out because so many government contracts and solicitations keep getting canceled and\/or frozen? \n\nIf it’s that, what other career field could I pivot towards? I have a mortgage and I was making the lion’s share of the money in my marriage so since I lost my job in March, our savings have taken an absolutely massive hit. I unfortunately can’t start too “at the bottom” of whatever career I pivot towards since I have to pay our mortgage (and basically everything else) so what could I pivot towards with my education and experience background? That would at least be $70k+ annually?\n\nAny advice\/different perspective is greatly appreciated. My stress is at max levels and I just spent 4 hours applying to basically anything I can find online. Do I need another Shipley certification? Or APMP?\n\nP.S. it just occurred to me… is it the AI? The filtering AI that companies use now to siff through applications and resumes? Am I just not getting through the filtering system enough?",
    "created_utc":1751333440.0,
    "subreddit":"jobs",
    "num_comments":3,
    "score":0,
    "sentiment":-0.5256
  },
  {
    "id":"1m0r7jt",
    "title":"Been job hunting for a year with a finance master’s, feeling stuck, any tips?",
    "text":"Hey everyone,\n\nI have a master’s degree in finance and have been searching for a job for over a year now. Despite applying daily on LinkedIn and other sites, I rarely hear back. It’s really frustrating and I’m starting to feel stuck.\n\nI’m curious to know how others broke through this kind of dry spell. Did you try any special websites, AI tools, networking hacks, or approaches that actually worked?\n\nAny advice or personal experience would be super helpful. Thanks in advance!",
    "created_utc":1752607618.0,
    "subreddit":"jobs",
    "num_comments":3,
    "score":1,
    "sentiment":0.7756
  },
  {
    "id":"1m44vyq",
    "title":"Are we using AI for CVs?",
    "text":"hi guys. I haven't made a CV for many years now, and back then it was bar work and casual jobs. I now work in digital media as a social media manager and I would like to search for a new job. What kind of CV are we presenting in this industry? I know now they will expect more numbers and figured involved in my experience (drove X% roas, all that nonsense) with it being digital media. Are people using AI to help write? How big is an average CV? Are cover letters a thing? Please help a girl in a toxic job! ",
    "created_utc":1752953596.0,
    "subreddit":"jobs",
    "num_comments":3,
    "score":0,
    "sentiment":0.8608
  },
  {
    "id":"1lwjl6s",
    "title":"Finding a Career Coach for mid-career tech seems impossible!?",
    "text":"To be very frank, I've had more \"help\" with my resume and cover letters than I can handle. It seems like that's all career coaches in the tech field want to do -- wordsmith and workshop application materials and maybe help gear them towards a particular job.  They might do interview practice and prep, but I interview well. (Hell, I even interview well with AI interviewers, or so says my Wellfound report.) What I'm finding feels geared towards early career, or even new to tech careers. I'm mid career, verging on senior.\n\nI want to find a career coach with an extensive network I can tap into, where they can put me in REAL interviews with REAL hiring managers, who have REAL jobs they are hiring for. I want to get non-AI feedback and get out of job seeking fast. I have a reasonable amount of money to spend on this, but not the 12k I was recently quoted by someone who further admitted they don't have a network in tech like this. This kind of coach exists in other disciplines, but I'm struggling to find even a solitary lead on a good tech coach for mid-to-late career techies.\n\nHelp?",
    "created_utc":1752170551.0,
    "subreddit":"jobs",
    "num_comments":3,
    "score":1,
    "sentiment":0.8945
  },
  {
    "id":"1lljnt7",
    "title":"I'm a manager in food service and want to transition to an office management position. Swapping industries, Please help!",
    "text":"I've been a manager at a commissary bakery for the past 11 years. The company went belly up and now I'm out looking for work. I know how to manage and train people, I manage and order inventory, I can negotiate turn over of product, be the front face to customers, and everything else you can imagine that comes with the management of resources on behalf of an owner. But I can't throw 50lbs bags of flour anymore and I feel strongly that my skills can very much be used in the retail or construction industry. I've not been in the job market for a very long time, AI vetting of resumes, submitting a resume then filling out the exact same crap on a form is all new to me. I surfed into this job on craigslist. Can you help bring me up to speed!? Wheres the new go to place for work? It certainly isnt' CL anymore. What do I need to know to be competitive in todays world? Have you made the transition from blue collar to white with a cold start, what was your experience? Caveat: I know that I may have to take a pay cut, thats fine. I just need to know what I have to do.",
    "created_utc":1750994447.0,
    "subreddit":"jobs",
    "num_comments":3,
    "score":2,
    "sentiment":0.8777
  },
  {
    "id":"1m34qc3",
    "title":"Looking for help figuring out my dream job at 35",
    "text":"I am at a big crossroads work-wise. I have degrees and some work experience (history+work in libraries and archives) but nothing \"sticks\" and I am let go pretty often. I think it's time I think about what I would like to do, and a corporate job isn't it. I have some savings I could use to get education or start a small venture.. Money-wise, I am at a point where I know I am not the sharpest and being able to just support myself and be content is enough.\n\nWhat are jobs some that could fulfill some, if not all this criteria?\n\n* Most probably self-employed\n* Possibility of working either remotely or at least alone\/secluded in a quiet-ish environment.\n* Working with people reasonably often but not 100% of the time\n* Generally predictable (I know that any job includes other duties like admin and whatnot, but hopefully I want to wake up and think \"today I am doing *this one job*\" and that be it.)\n* Upskilling at my own pace\n* Somewhat AI-proof for now, hopefully?\n\nThis leads me to maybe something in the beauty industry, fashion, or some trades, although I have no experience in that.  Some suggestions I have heard and liked were: food stylist\/photography, working in or opening an indie bookstore, or being a piercer\/tattoo artist.  *Please no IT! Please!* \n\nAs a side note, I was chatting with my sister recently and she mentioned her skincare lady: this woman offers strictly one one-size-fits-all facial service in her (own, quiet) office, charges over $100\/hr, chats with her clients maybe half the time, and gets to bring her dog to work. If this person wasn't already doing that, *this* would be close to my dream job.\n\nGrateful for your thoughts!",
    "created_utc":1752851046.0,
    "subreddit":"jobs",
    "num_comments":2,
    "score":2,
    "sentiment":0.9906
  },
  {
    "id":"1lp2g6h",
    "title":"How has AI impacted your job search?",
    "text":"We're a team of reporters at NBC News hoping to speak with people impacted by the ways in which AI has been helping, and\/or hurting, their job search. This can range from encountering AI in your job hunt — whether it was to speed up applying, or feeling like you're being turned down by bots.",
    "created_utc":1751378468.0,
    "subreddit":"jobs",
    "num_comments":2,
    "score":0,
    "sentiment":0.6486
  },
  {
    "id":"1m13vh1",
    "title":"Will I able to get any technical interview calls or internship based on this resume in 2025 ?",
    "text":"Have a look at my resume. Can I get any jobs in technical field. Share your opinion and thoughts. Also I have done lot of projects but haven't mentioned coz I don't have any active links to showcase it. Suggest me something course or certificate to add in it which can make my chances better to get a job or internship in financial year 2025. Open to any opinion or roast just make sure to help me by that at the end. Thankyou redditors.\n\n",
    "created_utc":1752641939.0,
    "subreddit":"jobs",
    "num_comments":2,
    "score":0,
    "sentiment":0.8824
  },
  {
    "id":"1lstm6b",
    "title":"Economics Job vs AI",
    "text":"Hello I am an undergraduate student studying economics in 3rd year. \nStraight to the point, Recently it's driving me nuts that whatever soft skill I try to gain, there's a better one with an AI software. As we know AI are replacing many jobs, I ask for your help to guide me in this regard. What are the possible jobs in near future that need economics background which are not AI-Sensitive?\n(I have a knack for data analysis, human behaviour)\nAlso what is the global situation on economic related jobs? Which sectors are thriving? \nTIA",
    "created_utc":1751779896.0,
    "subreddit":"jobs",
    "num_comments":1,
    "score":1,
    "sentiment":0.9213
  },
  {
    "id":"1lxu3u6",
    "title":"Worried my job might be replaced by AI, but what about middle managers in manufacturing?",
    "text":"Hi everyone,\n\nLately I’ve been thinking alot about this and honestly it’s kinda stressing me out. I work in manufacturing and I feel like more and more parts of my job could be replaced by AI or robots in the future. I’m not super technical but I can see how fast things are changing, new softwares, machines that do more, AI that tracks stuff and finds mistakes faster than people.\n\nWhat I can’t figure out is what happens to people like me in the middle. I’m not on the shop floor all day but I’m not high up management either. I guess I’m like a middle manager, I help coordinate people, fix daily problems, check quality, and report up the chain.\n\nI worry AI might do parts of my job too, like making reports, tracking numbers, even planning shifts and stuff. But can AI really do the human parts? Like solving conflicts, motivating people, handling unexpected issues that pop up everyday?\n\nI don’t really know how safe my job is in the long run. Should I be trying to move up? Or learn more tech skills? Or just focus on getting better at people management since AI might not do that well (yet)?\n\nAnyone else here in manufacturing feel the same? How are you dealing with it? Any advice would help alot.\n\nThanks for reading.",
    "created_utc":1752303599.0,
    "subreddit":"jobs",
    "num_comments":2,
    "score":3,
    "sentiment":0.977
  },
  {
    "id":"1lob5rh",
    "title":"Will a Startup Internship in AI\/AR Be Valuable for Landing Full-Time SWE or ML Roles?",
    "text":"Hey everyone,\n\nI’m seeking some advice on internship choices and resume impact. I recently earned my BSc in Financial Mathematics with a CS minor from TMU, and I’m actively applying for entry-level software engineering and AI\/ML roles in the United States. To date, I’ve completed one six-month internship but haven’t yet secured a full-time offer.\n\nAn opportunity just came up to intern at a very small startup where I’d get to dive into AI research, machine learning model development, and AR vision projects—definitely real, impactful work instead of menial tasks. But the startup is tiny, and I worry that future employers might not recognize or value the prestige of the company name. In your opinion, does deep technical experience at a small startup carry as much weight on a resume as an internship with a larger, more established tech firm? How have you seen startup internships perceived by hiring managers in AI\/ML or general software roles? Any suggestions on how to highlight and leverage this kind of experience for maximum impact would be amazing.\n\nThanks in advance for your feedback!",
    "created_utc":1751298871.0,
    "subreddit":"jobs",
    "num_comments":2,
    "score":0,
    "sentiment":0.968
  },
  {
    "id":"1llyx38",
    "title":"Is it just my connections, or my age group (25-28), that's making it so hard to network?",
    "text":"Sorry wasn't sure how to word the title - but context is that I work for a pretty awesome AI Computer Vision company for Manufacturing\/Logistics operations, and I went to STEM only college in Indiana where 99% of my friends\/connections work in Manufacturing. I grew up listening to my dad on the phone talking to people asking to be connected with someone they know, or asking his friends if they'd entertain a meeting for where he was working at because it fits their role and more often than not it'd be a yes. If it was a no, generally it was because they already had something in house or were talking to someone else about it. I've tried talking to some friends, and it's mind boggling to me how aversive they are to even try and make an introduction -  not because they don't want to be involved or don't think it's their place - but because they're uncomfortable. If this sounds salesy and elitist, then I apologize because that's not the thought process of this. For this post I don't care about how to make it so they're more comfortable because I'm not in sales, but I just want to get an idea if others my age have experienced the same thing where just mentioning \"would love to hear about what you're doing and maybe have an informal chat about if there's an application we have that might help\" makes them get so uncomfortable and physically say \"ahhhh i don't know mannnnnnn\".\n\nIf you are that person who reacts that way - is there something i'm missing? And more importantly, for the people who maybe used to be that way - do you think it was an age\/experience thing and it took you some getting used to in order to be able to be comfortable in trying to introduce something new to either your place of work or make an introduction to someone you know?\n\nEdit: I know bringing up my dads experience isn't the same bc he was out of my age bracket, but I asked him when he started doing things like that - and to him, (he's been in Finance or fintech business forever) he didn't understand\/comprehend really that anything would be different because that's how it's been forever. ",
    "created_utc":1751043201.0,
    "subreddit":"jobs",
    "num_comments":1,
    "score":1,
    "sentiment":0.9903
  },
  {
    "id":"1m2c5po",
    "title":"Want to get out of tech, not sure where to go",
    "text":"So, I currently work full-time remote as an IT tech over text chat for a relatively large insurance company. I've been working here for over 10 years now, and have been doing the full-time chats after I had a panic attack while working the phones. It's a long story that I don't want to get into, but I have a hard time taking calls and the job has changed so much from what it started as, and I am frankly uninterested in learning AI, but that seems to be the direction everything is going, and the manager here is talking about getting rid of the chat entirely.\n\nSo I am thinking about getting out of working IT stuff, but I don't exactly have a ton of marketable skills for non-tech stuff. At least none that I feel like I can use. I'm kind of the stereotypical stoner IT help desk guy, and I do love working remote. I suppose the whole reason I am posting here is to kind of get some idea of what to try and aim for. \n\nNot only that, but I haven't had to job hunt since the early 2000s, and all of that was when you'd still go in and talk to a manager at a store. I got this job via a career placement thing from college after I got out of the Marine Corps, which I joined because I was sick of working dead end retail jobs in the hillbilly hell I had found myself in. ",
    "created_utc":1752769752.0,
    "subreddit":"jobs",
    "num_comments":1,
    "score":3,
    "sentiment":-0.8871
  },
  {
    "id":"1lhus0h",
    "title":"My job search in Abu Dhabi so far",
    "text":"Hi,\n\nAbout me : \n\n* I'm 25 years old.  \n* 3+ years experience working as an Audio QC Engineer in an MNC called Deluxe Media Entertainment which has around 4K+ employees around the world. I worked in Bangalore, India. I've worked for major clients like Amazon Prime, Netflix, HBO Max, WB, Disney etc.\n* Current Location : Abu Dhabi, I'm on a Visit Visa and I'm staying with my parents.\n* Qualification : High School Diploma + Diploma in Audio Engineering\n* Current Goal : Find a Job in Abu Dhabi so I can stay with my parents and save up money and also get a degree through distant education. If I'm with my parents, I'll have support to study. I won't have to completely look after myself.\n* Roles I'm targeting : Data Entry, Office Admin, Sales, Document Control, Operations Assistant, Cashier, Audio Engineer.\n* Additional Certifications : I've done a Data Analytics Bootcamp from Coding Ninjas so I have knowledge in Excel, Google Sheets, Power BI, Python, SQL, Basic HTML, CSS etc.\n* Additional Interests : \n   * I also play piano, guitar and bass and I can produce music in DAW's. \n   * I'm proficient in many DAW's like Pro Tools, Ableton, Cubase, Studio One, FL Studio, Reaper etc. \n   * I also know how to edit videos using Premiere Pro. \n   * I'm also into AI. I've been trying out different AI tools like Ollama, Stable diffusion, Custom LoRa Training, Flux Models, Different prompting techniques with different LLM's etc.\n* Languages I'm good at : English, Malayalam, Hindi, Tamil.\n* I also wanted to go meet my gf in Thailand ( Before you ask : Yes she's actually a girl ). It's been 5 years. We met online and we've never met each other in person and I was never able to save money to go meet her which is also affecting me mentally.  \n\nChallenges I'm facing & what I've done so far:\n\n* Referrals play a major role in Abu Dhabi and unfortunately there is no one to refer me. Parents have been trying from their side but it's not working out. \n* I've tried applying mostly though Linkedin, Indeed and Career Websites. \n   * My findings : \n      * Most of them are ghost postings.\n      * I've been tailoring my resume for each job description using different AI tools like Google AI Studio, Gemini, Chat GPT, Job Owl Extension.\n      * I've tried using resume templates but they don't parse very well with ATS so I've been manually creating separate doc files for my resumes and I've been saving them to respective folders in my drive.\n      * I'm confident I have transferrable skills from my previous role which also included data entry, document control, skills to adapt to new software's and workflows very fast, good email etiquettes etc. in addition to the technical audio role.\n      * I've tried to be honest with my resume, I've also tried to fake it to bypass ATS when I started realizing how difficult it is to bypass ATS. \n      * I've tried tailored approaches and I've also tried mass applying approaches.\n      * I gave my resume to Lulu Hypermarket regional office (No Call back yet), I've also approached a few offices nearby my place and gave them my resume. (No Call backs).\n      * I've created an Upwork account for freelancing and bought some connects for bidding for work, but slowly realized that Upwork was almost like tinder. I never got a match for both and both apps kept asking me to boost my profile by paying them money. I've had better chances with tinder though.\n      * I've tried looking for VA jobs as well through reddit. Most of them were shady. \n      * I've also tried looking for other remote jobs but I think you all know how that might have went especially with my educational qualifications.\n      * I've also tried contacting some electronic retailer showroom like Sharaf DG but they ask if we have our own visa. My dad won't be able to sponsor a visa for me because I'm 25 which means I've crossed the age limit restriction in the UAE. \n      * I've also attended an interview at a music school but I didn't get the job because I was out of touch with my sight reading skills. \n   * Things I haven't done:\n      * I haven't gone out to the main city yet. It's just because most of the offices operate during the daytime from 9:00 AM to 5:30 PM and the heat during that time is too bad. I feel dizzy just going out to get some tea. I think My parents are disappointed in me because of this.\n      * There's also a lot of schools in the area we stay. My mom has been suggesting me to approach these schools for any office related work. I'm not sure if this will work out because I don't have a degree.\n* Other Challenges:\n   * Dad's debt :\n      * Dad is in huge debt, however he's confident he can finish it in a few years but I'm not sure about that.\n   * Constant fight between parents :\n      * Mom and Dad are fighting all the time for even the smallest of things. I've been seeing them fight for a long time and from what I realize, they both require different people foundationally. They're expecting each other to be different people but I can guarantee it's not possible. \n      * I've been asking them to attend some therapy but they're not because of the expense. \n      * Basically both of them never understands each others strengths and weaknesses. She keeps on judging him for everything he does and he hurts her back by judging her back. Their problems are so deep that it's very difficult to achieve happy resolutions. \n      * They're 50 now and they need each other. These fights happen most of the time and then they get back together and the cycle just keeps on going. \n   * Baldness :\n      * The water in Abu Dhabi makes you go bald very fast and my dandruff and hairfall has increased a lot. \n* Alternate options :\n   * I can go back to India, Maybe Chennai. \n   * I have friends there and I can find a small job there but then I'll have to start from Zero again. I'm bad at taking care of myself. I also won't be able to save anything if I'm staying by myself especially with the salary I'll earn in India so I guess I'm stuck in Abu Dhabi for now.\n\n  \nWhat do you guys think I should do ?",
    "created_utc":1750616547.0,
    "subreddit":"jobs",
    "num_comments":1,
    "score":2,
    "sentiment":0.9465
  },
  {
    "id":"1lqjimv",
    "title":"Finding a Job in the US Currently (on F1 Student Work Permit - OPT, Looking for sponsorship) - Biotech Companies",
    "text":"Hi All!\n\nI wanted to really like ask all the people who are currently applying to 10s\/ 100s of applications in a day (manually) , a few questions regarding The current Job Market (Biotech\/Bioengineering) in the USA has become somehow Intensely competitive. To every Single JOB (in Biotech - My Field) on LinkedIn, I see more than 150+ applications for a single role within just 24hrs of posting. Is everyone on F1 Visa OPT\/STEM, also facing the same problem? If so, How do you really crack it?\n\nI mean, Honestly, I do have a competitive profile but will require h1b sponsorship within the next 2 years. A Master's Degree with 2+ Years Exp (2 on going Publications in \"Nature\" ). \n\n\n:\n\nI typically apply to all the firms on LinkedIn for my respective title. Mostly, I'm unaware of whether they will provide sponsorship (H1B) or not. I use the H1bGrader Extension for this but its not totally useful. \n\nI used to use the email finder extension for cold emailing to HR\/ Hiring Managers about the job. IVE STOPPED THIS since Out of 150 emails, only a few 7-8 would reply and that too a trivial\/obvious reply.\nI also face difficult finding the right HR\/Manager for that respective positon.\n\nI match the Keywords using the Simplify extension tool and make sure keywords are >80% matched moat of the times.\n\nI DONT MAKE COVER LETTERS.\n\nPlease Critisize my application style first.\n\n\nSecondly,\nOut of several applications i do get an HR interview (sometimes even Manager and multiple other rounds), \n\nBut Currently even for a Master's Level Position, I always loose to a PhD candidate or similar for that position. (Even though they are overqualified)\n\nThis has happened till the last rounds of Companies like Altos Labs, Agilent technologies, etc.\n\nAnd Most of the HR interviews result in being totally ghosted by them.\n\nFINALLY, TO ALL WHO HAVE BEEN THROUGH THIS PAIN\/GOING THROUGH this, Please provide some tricks that can help me with mainly landing more and more interviews. \n\nDo you people use AI tools like Lazyapply, AiApply, Etc. And are they effective at all ?\n\nPlease provide any criticism, Sources, Info that you found helpful in your journey.\n\nThank you🥹🥹🥹🥹",
    "created_utc":1751527932.0,
    "subreddit":"jobs",
    "num_comments":1,
    "score":1,
    "sentiment":0.9768
  },
  {
    "id":"1lzt9wg",
    "title":"I Need help",
    "text":"Can you rate my resume and provide your feedback, Targeting 5+ YoE data analyst roles.   \nthanks",
    "created_utc":1752515393.0,
    "subreddit":"jobs",
    "num_comments":1,
    "score":0,
    "sentiment":0.6808
  },
  {
    "id":"1m1ewr0",
    "title":"Anyone found success using SimpleApply auto-apply bots?",
    "text":"SimpleApply auto-submits to roles based on AI-driven matching. Saves time, but does it generate quality leads or just spam? Curious about real-world results.",
    "created_utc":1752678123.0,
    "subreddit":"jobs",
    "num_comments":1,
    "score":2,
    "sentiment":0.3421
  },
  {
    "id":"1m1gbyv",
    "title":"Does Prep AI actually work?",
    "text":"Ive been seeing the app heavily promoted on tiktok and youtube but you have to pay to use it. Wondering if anyone has had any success landing interviews with it? Im currently still employed and I don’t have much time dedicated to submitting job apps so their swiping system would be alot of help for me😅",
    "created_utc":1752681191.0,
    "subreddit":"jobs",
    "num_comments":0,
    "score":0,
    "sentiment":0.9553
  },
  {
    "id":"1m2vuvy",
    "title":"Apple job help",
    "text":"Uk retail job help\n\nHi, hope whoever reads this is well!\n\nI just finished school \n\nI applied a few weeks for a retail job at my local Apple. I got accepted into their usual first stage ‘SHL AI behavioural assessment’\n\nI also filled out my profile fully listing my skills and work experience and whatever else needed (like education)\n\nI completed this on the day and still have not heard back, does anyone know the procedure from here because I really want to work for Apple, it’s my dream ",
    "created_utc":1752823399.0,
    "subreddit":"jobs",
    "num_comments":0,
    "score":1,
    "sentiment":0.9421
  }
]